[
   {
      "id":"p1",
      "pranayama_name":"Natural Breathing",
      "other_names":"Diaphragmatic breathing, Eupnea",
      "pranayama_type":"Breath awareness",
      "pranayama_steps":"\n1) Sit in a comfortable position. \n2) The body is stable, the shoulders are relaxed, chest is open and eyes gently closed. \n3) Become aware of the breath. Notice if it is shallow or deep.\n4) Notice what part of the body is moving, the abdomen or the chest.\n5)Notice if there is any sound with the breath. \n6) Try to focus only on the breath.\n7) Try to become aware of the temperature of the breath. \n8) When the air is inhaled it is a little cool, when it is exhaled it is a little warmer. \n9) Notice the difference. Notice if the breath is becoming smoother and deeper. \n10) Notice if there is any strain. Be aware only of the breath. \n11) Now try to become more aware of the breath entering the nostrils. \n12) Focus only on the nostrils.\n13) Now notice the breath flowing down towards the lungs. \n14) Focus only on that area. Now focus on the lungs, only on the lungs. \n15) Now try to follow the air flowing from the nostrils and down into the lungs.\n16) Follow the breath with the inhalation and exhalation. \n17) Try to focus only on the breath. \n18)Continue with this practice for as long as is comfortable.",
      "pranayama_timing":"Practice diaphragmatic breathing for 5 to 10 minutes 3 to 4 times per day. When you begin you may feel tired, but over time the technique should become easier and should feel more natural.",
      "pranayma_precautions":"NA",
      "pranayama_benefits":"NA"
   },
   {
      "id":"p2",
      "pranayama_name":"Adham Pranayama",
      "other_names":"Abdominal breathing",
      "pranayama_type":"Basic abdominal pranayma",
      "pranayama_steps":"\n1) Sit in a comfortable position with your knees bent.\n2) Relax your shoulders, head, and neck.\n3) Put one hand on your upper chest and the other below your rib cage so you can feel the movement of your diaphragm.\n4) Inhale slowly through your nose so that your stomach presses against your hand.\n5) Keep the hand on your chest as still as possible.\n6) Engage your abdominal muscles as you exhale through pursed lips, keeping the hand on your upper chest still.\n6) Continue breathing like this for the duration of your exercise session.",
      "pranayama_timing":"about 5 to 10 minutes of this exercise three to four times per day.",
      "pranayma_precautions":"\n1) Avoid doing adhama pranayama with your stomach too empty or full\n2) Avoid doing more than 3 rounds or a particular exercise.\n3) Avoid doing more than 20 fast respirations per round.",
      "pranayama_benefits":"\n1) Increases supply of oxygen and nutrients to cells throughout the body\n2) Helps increase the supply of blood and nutrients to muscle blood and bones\n3) Relaxes muscle spasm and relieves tension \n4) Releases and reduces muscular tension that eventually may cause structural problems\n5) Supports muscle growth and provides energy to get things done"
   },
   {
      "id":"p3",
      "pranayama_name":"Thoracic breathing",
      "other_names":"Diaphragmatic breathing",
      "pranayama_type":"Chest and other muscles that raise ribs",
      "pranayama_steps":"\n1) Stand up, staying still, and close your eyes.\n2) Inhale deeply until you can’t take in anymore air.\n3) Exhale until all air has been emptied from your lungs.\n4) Keep your eyes closed! Now, inhale again while picturing the number 1.\n5) Keep the air in your lungs for a few seconds, then let it all out.\n6) Inhale again while picturing the number 2.\n7) Hold your breath while counting silently to 3, then let it all out again.\n8) Repeat these steps until you’ve reached 8. Feel free to count higher if you feel comfortable.",
      "pranayama_timing":"NA ",
      "pranayma_precautions":"NA ",
      "pranayama_benefits":"NA "
   },
   {
      "id":"p4",
      "pranayama_name":"Deep Breathing",
      "other_names":"Diaphragmatic breathing, Abdominal breathing, Belly breathing.",
      "pranayama_type":"Deep breathing",
      "pranayama_steps":"\n1) Get comfortable. You can lie on your back in bed or on the floor with a pillow under your head and knees. ...\n2) Breathe in through your nose. Let your belly fill with air.\n3) Breathe out through your nose.\n4) Place one hand on your belly. ...\n5) As you breathe in, feel your belly rise. ...\n6) Take three more full, deep breaths.",
      "pranayama_timing":"Try to deep breathe for 10 minutes or until you feel relaxed and less stressed. Gradually work your way up to 15-20 minutes. If you're frazzled and don't have 10 minutes to de-stress, even a few deep breaths can help. Once you've practiced it a few times, a mini-version of this exercise can help ease tension",
      "pranayma_precautions":"\n1) Choose a place to do your breathing exercise. It could be in your bed, on your living room floor, or in a comfortable chair.\n2) Don't force it. This can make you feel more stressed.\n3) Try to do it at the same time once or twice a day.\n4) Wear comfortable clothes.",
      "pranayama_benefits":"\n1) Due to slowing of respiration rate the heart rate is reduced.\n2) Blood pressure is lowered.\n3) Stress and stress related ailments. Anxiety, tension, anger.\n4) More oxygen is made available per breath, making the breathing most efficient.\n5) Conscious deep breathing greatly affects the cortical activities, relaxing the nervous system, which calms the mind by removing thoughts and emotions.\n6) Enhanced movement of the diaphragm gives a good massage to the internal organs as the liver, pancreas, stomach, heart and lungs are attached to the diaphragm which is moved up and down during the breathing.\n7) Good preparation for labour\n8) Gives us control over our breath`"
   },
   {
      "id":"p5",
      "pranayama_name":"Nadi Sanchalana",
      "other_names":"Rapid breathing.",
      "pranayama_type":"Fast breathing:Type1: Inhaling and exhaling through both nostrils.Type2: Close the right nostril and inhale and exhale through the left nostril.Type 3: Close the left nostril and inhale and exhale through the right nostril.Type 4: Inhale through the left nostril and exhale through the right nostril.Type 5: Inhale through the right nostril and exhale through the left nostril.Type 6: Inhale through the left nostril, exhale through the right, inhale through the right and then exhale through left.",
      "pranayama_steps":"\n1) Relax the muscles in your neck and shoulders.\n2) Sit in a comfortable chair with your feet on the floor.\n3) Inhale slowly through your nose for 2 counts.\n4) Feel your belly get larger as you breathe in.\n5) Pucker your lips, as if you were going to whistle or blow out a candle.\n6) Exhale slowly through your lips for 4 or more counts.",
      "pranayama_timing":"NA ",
      "pranayma_precautions":"\n1) Fast breathing should not be done by those who have High Blood pressure, heart problems, ulcers, hernia. \n2) People who have undergone abdominal surgeries, heart surgeries, brain sugeries should consult the medical expert or consultant. \n3) This is not recommended during the pregnancy.",
      "pranayama_benefits":"\n1) Due to the fast inhalations and exhalations, the carbon dioxide levels in the blood fall and oxygen levels increase in the blood. Rich oxygenated blood is supplied to the vital organs, improving their function.\n2) Due to rapid exchange of gases on a cellular level, toxins are removed and the cells are revitalized.\n3) The fast movement of the diaphragm gives massage to the digestive organs, lungs and heart, increasing their efficiency.\n4) Increases the overall prana in the body.\n5) Gets rid of excess mucus which helps in removing sinusitis and common cold etc.\n6) Clears blocked nostrils in preparation for pranayam\n7) Increases lung capacity\n8) Preparation for labour, particularly during contractions"
   },
   {
      "id":"p6",
      "pranayama_name":"Viloma",
      "other_names":" Ladder Breath.",
      "pranayama_type":"Interuupted Breathing",
      "pranayama_steps":"\n1) Lie flat on a yoga mat, keeping your body in a straight line. Close your eyes and lie quietly for a minute.\n2) Breathe normally. Observe your breath.\n3) Take a deep breath and fill your lungs completely. Exhale completely.\n4) Now start with the interrupted inhalation. Inhale for 2-3 seconds, pause, hold the breath for 2-3 seconds. Continue to do this until the 5. \n5) lungs are completely full, which may involve 4-5 pauses. Don’t strain yourself.\n6) Exhale for 2-3 seconds, then pause, hold the breath for 2-3 seconds, pause once again. Repeat this until the lungs feel completely empty.\n7) This completes one cycle of viloma pranayama. Repeat these steps for 5-7 minutes before resting in savasana.",
      "pranayama_timing":"This pranayama exercise should be practiced daily, preferably in the morning before the sun comes up. It should be done before your meditation or asana yoga practice. In this busy world, it can just as easily be practiced while seated at your desk, traveling, or any time you need to find balance.Ensure that your back is straight and shoulders relaxed while you perform the pranayam.",
      "pranayma_precautions":"\n1) Beginners should only try simple anuloma viloma without breath retention.\n2) It is strongly advised that these exercises should be learned in the presence of an experienced yoga teacher only.",
      "pranayama_benefits":"\n1) Preparation for deep breathing\n2) Helps give finer control over the flow of air\n3) Helps to expand breath capacity\n4) Preparation for labour\n5) It brings a feeling of ease and lightness to the body.\n6) It brings a feeling of exhilaration and calm.\n7) It rests the nerves and soothes the brain."
   },
   {
      "id":"p7",
      "pranayama_name":"Anulom-Vilom",
      "other_names":"Alternate breathing technique.",
      "pranayama_type":"Alternate Nostrill Breathing",
      "pranayama_steps":"\n1) First sit on the Padmasana or Sukhasana (simple sitting pose), close your eyes and keep your spine straight.\n2)Keep your left hand in Chin Mudra and rest on your right knee.\n3) Close your right nostril with your right thumb in Vishnu mudra. Inhale slowly through your left nostril, inhale as much oxygen as you can so that your lungs get full of air.\n4) Remove your thumb from right nostril and exhale from the right while closing your left nostril.\n5) Now, inhale through your right nostril and close your right nostril and exhale from left nostril.\n6) Repeat this procedure as long as you feel comfortable. Remember it’s your body and you must not force it. Relax and repeat it for 3-4 times.",
      "pranayama_timing":"It can be done in the morning or in the evening. Ensure that you practice anulom vilom pranayama 4-5 hours after having your food.",
      "pranayma_precautions":"\n1) This pranayama should be done on an empty stomach, preferably in the early morning after bath. \n2) You can also practice this in the evening with a gap of 4-5 hours after the meal. \n3) Do not overdo the practice and increase the duration of inhalation and exhalation beyond your limit. \n4) Those suffering from heart disease or blood pressure should avoid retention of breath during the process. \n5) Women should avoid this during pregnancy and periods. If you have any medical concerns, talk with your doctor before practicing yoga.\n6) Cardiac or Blood pressure patients should not hold their breath while doing this pranayama just keep inhaling and exhaling.",
      "pranayama_benefits":"\n1) It removes toxins from your body and improves blood circulation\n2) Helps to keep diabetes under control and improves function of lungs\n3) Relieves stress, depression and calms your mind\n4) Helps to cure a headache, migraine, neurological problems, heart blockage and gastric problems\n5) It balances the two main energy channels i.e. Ida and Pingala. Then it awakens the central channel called Sushumna Nadi\n6) This breathing practice helps to clean the pranic channels and makes sure prana flow freely in the entire body\n7) An effective breathing exercise for weight loss"
   },
   {
      "id":"p8",
      "pranayama_name":"Sheetali",
      "other_names":"Cooling Breath.",
      "pranayama_type":"Cooling-Breath",
      "pranayama_steps":"\n1) Sit in any comfortable posture\n2) Place your hands on the knees in Gyan Mudra\n3) Close your eyes and roll up the tongue and shape it as a tube\n4) Inhale maximum through the tongue\n5) Take the tongue inside the mouth and close the mouth\n6) Slowly exhale through the nostrils, remaining aware of the area used for smelling\n7) Repeat the procedure for 4 rounds",
      "pranayama_timing":"If you are a beginner, in summers, you can do this cooling breath 5 times a day. Then gradually increase it to 10 times a day.Continue doing Sitali Pranayama for 2-3 minutes, then return to normal breathing and do it 2-3 times again.",
      "pranayma_precautions":"\n1) For the effective results out of this breathing exercise, it’s preferred to practice it in empty stomach.n2) Make sure your back and neck are not bent or curved as it restricts the Prana flow within the subtle body.\n3) Unlike other pranayamas, avoid doing Sitali Pranayama during winters and extreme cold weather as it could induce respiratory problems in your lungs\n4) Those having heart ailments should consult a doctor or an experienced Yoga trainer before trying to do Sitali Pranayama.",
      "pranayama_benefits":"\n1) It cools the body and helps nerves and muscles to relax\n2) This pranayama is beneficial for people suffering from high blood pressure\n3) It can help treat disorders of gulma (chronic dyspepsia) and spleen or other related diseases\n4) It promotes digestion\n5) It helps you control hunger and thirst\n6) Daily practice of Sheetali Pranayama can bring harmony in the body system and help calm the mind."
   },
   {
      "id":"p9",
      "pranayama_name":"Sitkari",
      "other_names":"Hissing breath.",
      "pranayama_type":"Cooling-Breath",
      "pranayama_steps":"\n1) Sit on the ground comfortably. (Sukhasana or Padmasana)\n2) Keep breathing normally for a few minutes and relax.\n3) Now touch upper and lower teeth together and touch your tongue upwards.\n4) Open your lips and start inhaling deeply which produces a hissing sound.\n5) Hold your breath for few seconds then exhale through the nose. \n6) Remember that the duration of exhalation should be twice of the inhalation.\n7) Again inhale and exhale as per above steps. Repeat this for 10-15 times.",
      "pranayama_timing":"Sitkari Pranayama is a great yogic breathing exercise which can be done anytime, anywhere to cool down your mind & body Especially in summers to cool down your body temperature",
      "pranayma_precautions":"\n1) Should be avoided in a AC room or winter season.\n2) Should be done on an empty stomach and in a fresh air.\n3) Low blood pressure patient should not practice Sitkari breathing exercise.\n4) If you are suffering from cold, cough, constipation or asthma then avoid it.\n5) If you are not able to practice Sitkari breathing exercise then you should practice Sheetali Pranayama.",
      "pranayama_benefits":"\n1) Cools down your body.\n2) Lowers down your high blood pressure.\n3) Reduces the excessive stomach heat.\n4) Reduces pitta dosha.\n5) Calms your mind and reduces stress.\n6) Reduces your anger and fatigue.\n7) Improves health of teeth."
   },
   {
      "id":"p20",
      "pranayama_name":"Kaki Mudra",
      "other_names":"Crow's beak gesture.",
      "pranayama_type":"Cooling-Breath",
      "pranayama_steps":"\n1) Sit in any comfortable meditation asana like Padmasana, Sukhasana, Swastikasana, Siddhasana or Vajrasana.\n2) Close your eyes and breath normally with attention on the inhalation and exhalation.\n3) Now, purse your lips to make it rounded like a crow’s beak, so that you can breathe in through the mouth, through the lips.\n4) Take your attention to the tip of the nose.\n5) Breath in slowly and deeply through the mouth.\n6) Hold the air inside you for few seconds\n7) Close the lips and breathe out slowly through the nose.\n8) Repeat this for at least 2 – 5 minutes. You can practice longer if you wish.\n9) You can do Kaki Mudra, even sitting on a chair in a relaxed way.",
      "pranayama_timing":"Sitkari Pranayama is a great yogic breathing exercise which can be done anytime, anywhere to cool down your mind & body. It provides relief & relaxation from stress. It also helps in reducing your body's temperature.Repeat up to 20 times.",
      "pranayma_precautions":"\n1) Do not practice if there is glaucoma, low blood pressure, cough or cold.\n2) For diabetic retinopathy or recent eye operation one should consult an expert before practicing.",
      "pranayama_benefits":"\n1) In Kaki mudra, the lips are pursed to resemble the beak of a crow. The inhaled air stimulates the wall of the mouth and pharynx. This activates the digestive secretions.\n2) Kaki Mudra cools the body.\n3) This mudra gives the benefits of Nasikagra Dhristi as well because the attention is held on the tip of the nose.\n4) It eliminates many illnesses and keeps the body healthy.\n5) This mudra is good for the skin and reduces wrinkles on the face.\n6) The ancient yogis created this mudra after observing the crows. The crow lives for long number of years with good health. This mudra enhances health as well as longevity.\n7) This mudra gives benefits similar to Sheetali pranayama as both cools the body."
   },
   {
      "id":"p21",
      "pranayama_name":"Kumbhaka",
      "other_names":" Breath retention",
      "pranayama_type":"Breath Retention",
      "pranayama_steps":"\n1) Antara Kumbhaka requires the application of both Jalandhara and Mula Bandhas; in addition the rib case gently \"hugs\" the lungs.\n2) Establish Sama Vritti Ujjayi (and for this example, the vritti count is 6 OMs). To begin, apply the two bandhas as you near the end of your inhale, and retain the breath for 2 OMs, no more. Gently squeeze the ribs against the expanded lungs. Then exhale, concurrently releasing Mula Bandha and, when finished, raise your head to neutral. DON'T perform Kumbhaka on successive breaths; take 2 to 3 Ujjayi breaths before the next retention.\n3) In general your first Kumbhakas should be one-third to one-half the length of your Sama Vritti count. Practice at this level until you're completely comfortable, which may take several weeks or longer.\n4) Then gradually reduce the number of Ujjayis between Kumbhakas until you can comfortably retain your breath for 2 OMs on successive inhales for about 5 minutes. Next increase your Kumbhaka to 3 OMs, but again separate them by 2 to 3 Ujjayis. Again gradually reduce the Ujjayis until you can comfortably retain for 3 OMs on successive inhales for 5 minutes.\n5) Proceed methodically until your Kumbhaka count matches your Sama Vritti count. Now STOP. Don't go any further without direct guidance from an experienced teacher.",
      "pranayama_timing":"After a full inhalation for 5 seconds, it suggests retaining the air for 10 seconds, exhaling smoothly, and thentaking several ordinary breaths. It recommends five such rounds per pranayama session, increasing the timeof retention as far as is comfortable by one second each week of practice",
      "pranayma_precautions":"\n1) Kumbhaka has to be practiced in a relaxed state of mind to revitalize the nervous system\n2) Don't hold your breath by force, don't go beyond your capacity.\n3) Don't practice Antara Kumbhaka before mastering puraka (inhale) and rechaka (exhale), start with ujjayi or other technique\n4) Don't practice Bahya Kubakha before mastering Antara Kumbakha\n5) Always practice sitting or laying down, never standing\n6) Practice this pranayama on an empty stomach",
      "pranayama_benefits":"\n1) This pranayama is believed to strengthen the diaphragm as you hold your breathe deeply and hold your breath. \n2) It is also very good at increasing lung capacity due to the deep inhalation. \n3) Kumbhaka pranayama cleanses the respiratory system. It cleanses the residual air or dead space air and alveolar air. \n4) It activates the respiratory center in the brain. This is due to the increase in carbon dioxide during retention which triggers the brain for better oxygen retention and interchange. n5) Increases oxygen retention and the amount of oxygen in the blood. This, in turn, improves health and enhances concentration. When your body is yearning to take a breath when in retention, your body focuses on that which improves the concentration\n6) This pranayama relieves the body and the mind of stress and anxiety. It clears thoughts and enhances memory\n7) It reduces strain on the circulatory system of the body. \n8) It is very ideal as pre-meditation pranayama. It settles the body and the mind grounding it and preparing it for meditation. \n9) It can relieve complications such as blockage, acidity, gastric problems, allergies, asthma, constipation and problems with reproductive organs."
   },
   {
      "id":"p22",
      "pranayama_name":"Kapalabhati",
      "other_names":"breath of fire",
      "pranayama_type":"Shatkarma, Breathing Technique",
      "pranayama_steps":"\n1) Keep breathing gradually while sitting in Padmasana.\n2) Inhale and start performing Kapalbhati as stated before. That means a strong Rechaka, natural Pooraka and again strong Rechaka and natural pooraka.\n3) Keep on doing this rotation swiftly in rhythmic manner.\n4) Perform as many cycles as possible and then keep breathing gradually. All these processes are included under one cycle of Kapalbhati.",
      "pranayama_timing":"In a cycle of Kapalbhati, swift Rechakas followed by Poorakas are expected. Both the actions are so swift that the duration cannot be definitely determined. However, after studying the process minutely, it can be said that Pooraka and Rechaka together about half second is the duration. (This period is further reduced by practice) Approximately three fourth time is required for Rechaka and one fourth for Pooraka. Of course, this is just to give an idea. It is not perfect and may not be strictly adhered to. It is not possible to adhere to it strictly. None of the ancient Sanskrit yoga describes how many cycles of Rechaka and Pooraka should be performed in a cycle of Kapalbhati. When the process can be performed neatly, the Pooraka and Rechaka should be performed for at least 21 times in a cycle of Kapalbhati. Such three cycles may be performed in one sitting. When this much is achieved, then the repetitions within a cycle can be increased. Each one should increase the repetitions as per his individual capacity and strength.",
      "pranayma_precautions":"\n1) It is said that in a cycle of Kapalbhati, maximum repetitions of Rechaka and Pooraka should be performed. For a common person, 120 repetitions per minute i.e. two per second is an ideal ratio. Sadhakas above the level of common person can go up to 200 repetitions. It is not advisable to increase the number beyond that.\n2) Patients suffering from heart trouble, lung trouble should practice this under an expert guidance. Those suffering from diseases of blood circulation should perform the process very carefully. They should perform the process under the guidance and care of experts.",
      "pranayama_benefits":"\n1) The breathing technique involves \"active exhalation and passive inhalation\". During inhalation the stomach sinks in and vice-versa during exhaling. This stomach movement is therefore beneficial for the muscles around it, including that of the liver and pancreas. The blood flow to these areas also increases.\n2) It aids digestion and removal of acidity and gas related problems.\n3) Regular practice of kapalbhati is also beneficial for belly fat loss.\n4) The technique involves forceful breathing which strengthens lungs and increases its capacity.\n5) \"Practicing Kapalbhati helps in removing blockages in the heart and lungs,\" said Anju.\n6) It also increases blood supply to various parts of the body.\n7) It activates the body and removes lethargy. Facial radiance is a natural benefit as the name suggests.\n8) It activates the brain cells and improves memory and concentration power.\n9) Kapalbhati is great for focus and checks forgetfulness."
   },
   {
      "id":"p23",
      "pranayama_name":"Ujjayi Pranayama",
      "other_names":"Ujjayi Breath , Cobra breahing",
      "pranayama_type":"Victorious breath",
      "pranayama_steps":"\n1) Close the mouth and constrict the throat (the glottis — a part of larynx).\n2) Make a short exhalation and then start inhaling—slowly and rhythmically in one long and unbroken inspiration.\n3) Allow the air to pass through the constricted throat, creating a “friction sound”.\n4) Continue inhaling till a sense of fullness is felt in the chest.\n5) Retain the inhaled air for a period of 6 seconds (preferably double the period of inspiration).\n6) Ensure: While sitting spine, head and neck is maintained erect.\n7) Facial muscles are relaxed and nose is not constricted. Inhalation is slow and rhythmic – long, unbroken and without jerks.\n8) Now exhale as naturally as possible – gradually, avoiding jerky or hasty movements.\n9) Take few normal breaths and relax.",
      "pranayama_timing":"Practice daily, 5 rounds/session with pause in-between rounds. Begin with a count of 3 seconds inhalation and 6 seconds retention. Gradually increase it by 1 sec/every week, when practised daily. Practice without strain to a count as per individual comfort",
      "pranayma_precautions":"Not recommended in serious cardiac and hypertension cases. Can practice without retention of breath.",
      "pranayama_benefits":"\n1) Helps rectify fluid retention in the body (edema/ dropsy).\n2) lears phlegm & increases appetite.\n3) Beneficial in chronic cold, cough, indigestion, liver problems, dysentery, fever and other diseases.\n4) Ghatashudhhi or purification of seven dhatus (elements) Skin, flesh, blood, bones, marrow, fat and semen.\n5) There is enrichment of the voice.\n6) Stimulates and balances the thyroid."
   },
   {
      "id":"p24",
      "pranayama_name":"Bramari Pranayma",
      "other_names":"Humming Bee Breath.",
      "pranayama_type":"Humming Bee breath",
      "pranayama_steps":"\n1) Sit in a quiet and well ventilated corner and close your eyes.\n2) Place your index fingers on your ears right at the cartilage.\n3) Breathe in and while breathing out press the cartilage with your fingers. Keep the cartilage pressed while making a loud humming sound like a bee.by TaboolaSponsored LinksYou May Like4-Year-Old’s Disease Has Damaged His Bone Marrow. Help HimKettoCreate Professional Invoices on Imprezz.Imprezz\n4) Breathe in again and out and continue the same pattern for around 6-7 times.",
      "pranayama_timing":"Yogic practitioners follow different styles and methods of performing these exercises, and the duration is mentioned as at least ten minutes. Initially, a single cycle of bhramari is performed and, with practice, duration can be increased to ten minutes",
      "pranayma_precautions":"\n1) Ensure that you are not putting your finger inside the ear but on the cartilage.\n2) Don’t press the cartilage too hard. Gently press and release with the finger.\n3) While making the humming sound, keep your mouth closed.\n4) You can also do Bhramari pranayama with your fingers in the Shanmukhi Mudra.\n5) Do not put pressure on your face.\n6) Do not exceed the recommended repetitions of 3-4 times.\n7) The only prerequisite is that this pranayama should be done on empty stomach.",
      "pranayama_benefits":"\n1) Mental tension, anxiety, anger, stress.\n2) Insomnia, especially when done before bed\n3) Strengthens the throat and voice, useful for any throat problems\n4) High blood pressure\n5) For healing of body tissue after operation, useful postnatally\n6) Improves hearing\n7) Useful to practice postnatally when soothing a baby\n8) Allows one to becomes more introverted.\n9) Useful preparation for meditation.\n10) Can be helpful during labour\n11) Stimulates the parasympathetic nervous system, inducing muscular relaxation\n12) Good for the thyroid’ increases psychic sensitivity and awareness of subtle sound vibrations which is useful for Nada Meditation"
   },
   {
      "id":"p25",
      "pranayama_name":"Bhastrika Pranayma",
      "other_names":"Bellows breathing",
      "pranayama_type":"Bellow's Breath",
      "pranayama_steps":"\n1) First of all, place a mat on a clean and flat place and sit on it in some position Padmasana or Sukhasana.\n2) We advise you to sit with your backbone straight and make sure to close your eyes. Keep both your hands straight at the knees and join the index finger with the thumb or Gyan mudra.\n3) Sit in meditation for a while.\n4) Now take deep breaths through both the nostrils while making sure that your mouth does not open at all while doing this exercise.\n5) In the process of breathing, your lungs should swell up completely.\n6) After this, you have to release the filled breath through both the nostrils in one stroke.\n7) The speed of inhalation and exhalation should be as rapid as that of “blower” and the inhalation should be taken in and out completely.\n8) Breathe inward again and forcefully exit it again.\n9) The exhalation speed should be so rapid that the lungs should shrink with shock.\n10) A cycle of Bhastrika Pranayama completes from breathing to quitting.\n11) While doing this pranayama, first the breath speed should be slow, then the medium and after that breathe at high speed and leave.",
      "pranayama_timing":"Time to inhale and exhale is to be kept the same. While doing Bhastrika Pranayama, the time to breathe in two and a half seconds (2.5 sec) and the time to exhale is also said to be two and a half seconds (2.5 sec). In this way, Bhastrika Pranayama can be done 12 times in a minute.As you progress, the ratio for inhaling and exhaling can be changed to 1:2, which means if inhalation is 2.5 seconds, then exhalation is 5 seconds.",
      "pranayma_precautions":"\n1) This pranayama should not be practiced by pregnant women or people having high blood pressure.\n2) Beginners should practice this pranayama slowly.\n3) Patients suffering from lung, heart and high blood pressure problems should always practice this process with slow speed. Do not do this pranayama if the problem is serious.\n4) Do not exceed the maximum 2-minute practice of Bhastrika during the summer season.\n5) Before performing Bhastrika Pranayam, clean the nose thoroughly.\n6) While doing this, you should stop it immediately when you see symptoms like dizziness, nausea, nervousness or restlessness.",
      "pranayama_benefits":"\n1) Practice is ideal for purifying blood\n2) Improves complexion.\n3) Clears the air passages.\n4) Gives massage to the chest area.\n5) Warms the body up\n6) Used for reducing fats\n7) Speeds up the metabolism.\n8)Tones digestive system.\n9) Helps remove excess mucus, helpful when there is cough or cold.\n10) Can be helpful during labour.\n11) Balances the nervous system.\n12) Brings focus and calmness.\n13) Gives energy.\n14) Helps with depression.\n15) Improves circulation to the heart and lungs.\n16) In Bhastrika Pranayama, when we inhale forcefully, there is a lot of oxygen in the lungs which helps in purifying the blood. This balances Vata, Pitta, and Kapha.\n17) This pranayama also helps us in reducing belly fat.\n18) By doing Bhastrika Pranayama, purification of all the nerves of the body and blood circulation process in the body improves.\n19) This pranayama helps in Kundalini Jagran, keeps the brain healthy and helps it to concentrate.\n20)This posture must be done in the winter season, it produces heat in the body.\n21) It makes our lungs strong. Lungs are an important part of our body. With every breath the more oxygen reaches inside the body, the more healthy the body remains.\n22) It improves general health and activates all the organs.\n23) Performing pranayama early in the morning helps one to obtain naturally glowing skin."
   },
   {
      "id":"p26",
      "pranayama_name":"Surya-Bhedan Pranayama",
      "other_names":"Sun-Piercing Breath",
      "pranayama_type":"Right Nostrill breathing",
      "pranayama_steps":"\n1) Close the left nostril, using your finger and start breathing in. Try to use full seconds.\n2) Hold both nostrils, using your thumb and ring finger, and hold your breath.\n3) Open your left nostril and breath out slowly and steadily.\n4) Repeat from Step 1.",
      "pranayama_timing":"When you start doing Surya bhadhana, the process of breathing, hold and exhaling should be done 5 to 10 times at the initial stage.",
      "pranayma_precautions":"\n1) Surya Bhedana pranayama should be practiced on an empty stomach.\n2) All the inh:alations should be done through the right nostril and exhalations through the left.\n3) It should be done in the morning or evening or both. If you don’t have the time in the morning or evening, you can do it at your own convenience.\n4) Make sure that you practice Surya Bhedana pranayama 4–5 hours after having your food.\n5) Inhalation and exhalation should be in the ratio of 1:2.\n6) If you feel even a little bit of discomfort then you can reduce the ratio of breathing.\n7) People suffering from heart disease, high blood pressure or epilepsy should avoid this Pranayam.\n8) People who have undergone brain surgeries, heart surgeries or abdominal surgeries should consult the medical expert or consultant before doing this Pranayam.\n9) This pranayama increases the heat of your body so it should be avoided if suffering from fever.",
      "pranayama_benefits":"\n1) This type of yogic breathing influences brains activity in different ways.\n2) Surya Bhedana Pranayama activates the body and bodily functions.\n3) The digestive fire is increased by this pranayama.\n4) It destroys all diseases that are caused by the insufficiency of oxygen in the blood.\n5) Surya Bhide Pranayama has also effects on shooting ability in Basketball players. (study)\n6) The Hath Yoga says that Surya Bhedana Pranayama cleans the frontal sinuses, destroys disorders of Vata, and destroys intestinal worms.\n7) Activates and stimulates the pranic energy by energizing the Pingala Nadi.\n8) It helps alleviate dullness, lethargy, and depression.\n9) Brings fresh energy to the body so one can perform physical activities more efficiently.\n10) Useful in treating low blood pressure and infertility in women.\n11) It increases body temperature, thus removing the Kafa (mucus) imbalance. This is very effective in obesity. Regular practice of right nostril breath is helpful in weight loss.\n12) Very effective for stress management.\n13) It helps reducing anxiety, depression, and other mental illnesses.\n14) Balancing Ida and Pingala removes all the blockages in the pranic energy channels, which may lead to spiritual awakenings.\n15) It gives all the benefits of deep breathing as well."
   },
   {
      "id":"p27",
      "pranayama_name":"Nadi Shodhana",
      "other_names":"Alternate Nostril Breathing",
      "pranayama_type":"Left nostrill Breathing",
      "pranayama_steps":"\n1) Sit comfortably with your spine erect and shoulders relaxed. Keep a gentle smile on your face.\n2) Place your left hand on the left knee, and palms open to the sky or in Chin Mudra (thumb and index finger gently touching at the tips).\n3) Place the tip of the index finger and middle finger of the right hand in between the eyebrows, the ring finger and little finger on the left nostril, and the thumb on the right nostril. We will use the ring finger and little finger to open or close the left nostril and thumb for the right nostril.\n4) Press your thumb down on the right nostril and breathe out gently through the left nostril.Now breathe in from the left nostril and then press the left nostril gently with the ring finger and little finger.\n5) Removing the right thumb from the right nostril, breathe out from the right.\n6) Breathe in from the right nostril and exhale from the left. You have now completed one round of Nadi Shodhan pranayama.\n7) Continue inhaling and exhaling from alternate nostrils.\n8) Complete 9 such rounds by alternately breathing through both the nostrils. After every exhalation, remember to breathe in from the same nostril from which you exhaled. Keep your eyes closed throughout and continue taking long, deep, smooth breaths without any force or effort.",
      "pranayama_timing":"Nadi shodhana can be immensely rewarding, even when practiced for as little as five minutes on a regular basis, but practicing daily for ten to fifteen minutes offers even deeper benefits. When you are ready to close your practice, complete your final round of nadi shodhana with an exhalation through the left nostril.",
      "pranayma_precautions":"\n1) Do not force the breathing, and keep the flow gentle and natural. Do not breathe from the mouth or make any sound while breathing.\n2) Do not use the Ujjayi breath.\n3) Place the fingers very lightly on the forehead and nose. There is no need to apply any pressure.\n4) In case you feel dull and are yawning after practicing Nadi Shodhan pranayama, check the time you take to inhale and exhale. Your exhalation should be longer than inhalation.",
      "pranayama_benefits":"\n1) Excellent breathing technique to calm and center the mind.\n2) Our mind has a tendency to keep regretting or glorifying the past and getting anxious about the future. Nadi Shodhan pranayama helps to bring the mind back to the present moment.\n3) Works therapeutically for most circulatory and respiratory problems.\n4) Releases accumulated stress in the mind and body effectively and helps to relax.\n5) Helps harmonize the left and right hemispheres of the brain, which correlates to the logical and emotional sides of our personality.Helps purify and balance the nadis - the subtle energy channels, thereby ensuring a smooth flow of prana (life force) through the body.Maintains body temperature."
   }
]
