[
      {
         "id":"1",
         "pose_name":"Lolasana",
         "other_names":"Swinging Posture, Pendant Pose, Lol Asan, Lola Asana, Uthitapadmasana, Uthitta/ Uthita-Padma Asana, Uthit padm Asan",
         "pose_description":"Lolasana (Pendant Pose) is a beginning arm balance that presents an experience requiring courage: the courage necessary to literally pull yourself up off the floor.",
         "pose_steps":"\n1) Start from Padmasana and bring the hands to the floor on the outside of the thighs.\n2) Inhale and press down into the palms as you engage the abdomen and lift the legs and buttocks off the floor.\n3) Take several breaths and release.",
         "pose_release":"\n1) To release, come back to the padmasana position loose your legs and relax.",
         "pose_benefits":"\n1) Strengthens the abdominal muscles and the arms.\n2) Lolasana builds awareness in the core of the body. \n3) It helps to build abdominal and arm strength while encouraging usage of uddiyan bandh.",
         "pose_precautions":"\n1) Not for the persons who have recent or chronic wrist or back injury.",
         "pose_links":"https://rb.gy/pjo9jz"
      },
      {
         "id":"2",
         "pose_name":"Pavanmuktasana",
         "other_names":"Wind-freeing Posture, Wind releaving Pose, knee Squeeze Posture, Pavan or Pawan Mukt Asan, Pavana or Pawana Mukta Asana, Pawanmuktasana",
         "pose_description":"In Sanskrit “Pavan” means air, “mukta” means release or free. Pavanmuktasana balances the wind in whole body.",
         "pose_steps":"\n1) Lie on your back. Hug your knees into your chest, while you keep your head, neck and shoulders relaxed and on the floor.\n2) Breathe normal.\n3) Focus: Close your eyes or gaze beyond your knees and relax your back muscles.\n4) Hold the posture for as long as it feels good. \n4)  Practice this posture after backbends to release the muscles.",
         "pose_release":"\n1) While inhaling release both the legs.\n2) One must rest before repeating the exercise.",
         "pose_benefits":"\n1) This posture releases the muscles of the lower back and relaxes the body.\n2) This-asana regulates wind in the body.\n3) It relieves constipation and indigestion.\n4) It reduces obesity and excessive fat of the abdomen.\n5) It helps in keeping away the disease of the lungs and the heart.\n6) For people suffering from wind trouble, acidity and gas formation, it has an \n7) instant corrective effect.\n8) It is also useful in the treatment of impotence, sterility and menstrual problems.",
         "pose_precautions":"\n1) Pregnant women should not perform this asana.People with serious back conditions, such as sciatica and slipped disc should avoid this asana.",
         "pose_links":"https://rb.gy/rlhlsh"
      },
      {
         "id":"3",
         "pose_name":"Bhujangasana",
         "other_names":"Full Snake Posture, Cobra Pose, Serpent, Samp Asan",
         "pose_description":"This is a basic yoga posture. It is very easy to do especially if your back is not too stiff and rigid. Regular practice of this asana makes child birth easy, good for digestion and constipation and gives a good blood circulation.",
         "pose_steps":"\n1) Lie down on the floor with your legs together and your palms down under your shoulders and rest your forehead on the floor.\n2) Your elbows should touch your middle portion of the body.\n3) Inhale, and raise the head and chest above the navel area, upwards.\n3) Tighten the legs from the waist down to the toes.\n4) Hold your breath and retain in the same position for a while",
         "pose_release":"\n1) Exhale, and simultaneously lower the head towards the floor.\n2) Relax your body and rest with your right or left cheek on the floor for about 6 seconds.",
         "pose_benefits":"\n1) This asana brings a rich blood supply to the spinal region and increases flexibility.\n2) Energizes and activates the upper areas of the body like head, face, neck, shoulders and chest, and gives the youthful appearance.\n3) Good for troubles like constipation, indigestion and it increases appetite.",
         "pose_precautions":"\n1) Not for the people who are suffering from peptic ulcer, hernia or hyperthyroid.\n2) Do not practice cobra asana while pregnancy.",
         "pose_links":"https://rb.gy/gwgyz8"
      },
      {
         "id":"4",
         "pose_name":" Purna-Salabhasana",
         "other_names":"Full Locust Posture/ Pose, Purna Shalabha or Salabha Asana, Puran Shalabh or Purn Salabh Asan",
         "pose_description":"Purna-Salabhasana is a reverse posture to the Cobra Posture, which gives a backward bend to the spine. Values of certain asanas are maximised when done one after the other.",
         "pose_steps":"\n1) Lie face down on the floor on your stomach, hands stretched backwards close to the body and the legs straight. \n2) Making fists of the hands bring them together beneath the thighs with the wrists touching.\n3) Inhale as much air as you can. \n4) Holding your breath make your head straight and put the chin on the floor (on a folded blanket or towel). \n5) Tighten both the legs and lift them up as high as you can. \n6) Do not bend the knees.\n7) Remain in the same posture for a few seconds.\n8) Exhale and simultaneously lower the legs slowly to the floor. \n9) Do not drop the legs. \n10) By the time the legs touch the floor you should finish exhaling. \n11) You have completed one round of a most strenuous posture.",
         "pose_release":"\n1) Stay for 30 seconds to 1 minute, then release with an exhalation.\n2) Take a few breaths and repeat 1 or 2 times more if you like.",
         "pose_benefits":"\n1) Strengthens the muscles of the spine, buttocks, and backs of the arms and legs.\n2) Stretches the shoulders, chest, belly, and thighs.\n3) Improves posture.\n4) Stimulates abdominal organs.\n5) Helps relieve stress.",
         "pose_precautions":"\n1) Not for the persons who have following porblems:Headache\n2) Serious back injury\n3) People with neck injuries should keep their head in a neutral position by looking down at the floor; they might also support the forehead on a thickly folded blanket.",
         "pose_links":"https://rb.gy/lsy34u"
      },
      {
         "id":"5",
         "pose_name":"Paschimottanasana",
         "other_names":"Paschimotanasana, Back-stretching Posture, seated forward bend pose, Pashchim Uttan Asan, Pashchima Uttana Asana, Paschimottana",
         "pose_description":"Literally translated as \"intense stretch of the west,\" Paschimottanasana can help a distracted mind unwind.",
         "pose_steps":"\n1) From Staff Pose - Dandasana bring the arms straight out to the sides and up over your head.\n2) Inhale and draw the spine up long.\n3) As you exhale, begin to come forward, hinging at the hips.\n4) On each inhale, extend the spine and on each exhale come a bit further into the forward bend.\n5) Keep the neck the natural extension of the spine.\n6) Do not round the back.\n7) Take hold of the ankles or shins, whichever you can reach.",
         "pose_release":"\n1) Stay in the pose anywhere from 1 to 5 minutes. \n2) To come up, release the hands, straighten the elbows and lift the torso away from the thighs, inhale and lift the torso up in a flat back by pulling the tailbone down and into the pelvis and engaging the abdominal muscles",
         "pose_benefits":"\n1) Calms the brain and helps relieve stress and mild depression.\n2) Stretches the spine, shoulders and hamstrings.\n3) Stimulates the liver, kidneys, ovaries, and uterus.\n4) Improves digestion.\n5) Helps relieve the symptoms of menopause and menstrual discomfort.\n6) Soothes headache and anxiety and reduces fatigue.\n7) Therapeutic for high blood pressure, infertility, insomnia, and sinusitis. \n8) Traditional texts say that Paschimottanasana increases appetite, reduces obesity, and cures diseases.",
         "pose_precautions":"\n1) Not for the people who have the problem of asthma and diarrhea.\n2) Back injury: Only perform this pose under the supervision of an experienced teacher.",
         "pose_links":"https://rb.gy/ktw9ii"
      },
      {
         "id":"6",
         "pose_name":"Shashankasana",
         "other_names":"The Moon Pose, Hare Posture, Shashanka-Asana, Shashank-Asan, Sasankasana, Sasank",
         "pose_description":"Shashanka' in Sanskrit means the moon, that’s why it is called moon pose also.",
         "pose_steps":"\n1) Sit with legs folded backwards, heels apart, knees and toes together (sit in vajrasana).\n2) Adjust your hips between the heels (Vajrasana). \n3) Slowly raise your arms over the head.\n4) While exhaling, slowly bend forward and stretch your palms on the floor with abdomen pressing against the thighs.\n5) Then bring your face downwards and touch the floor with the forehead without raising the buttocks. \n6) Inhaling slowly, return to an upright position, and then reverse the process",
         "pose_release":"\n1) To release, slowly revert to the normal position of Vajrasana. \n2) You may do this asana at least 8 to 10 times.",
         "pose_benefits":"\n1) This asana stretches the rectus muscle of the abdomen and helps in improving the digestion.\n2) It also relieves constipation and benefits people with sciatica and hypertension.",
         "pose_precautions":"\n1) Do not release the ankles from their position, without raising the back.\n2) Not for the people who are suffering from pain in the hip joint.",
         "pose_links":"https://rb.gy/dtmqvz"
      },
      {
         "id":"7",
         "pose_name":"Setu-Bandha-Sarvangasana",
         "other_names":"Bridge Posture/ Pose, Setu Bandh Sarvang Asan, Bandha Sarvanga Asana",
         "pose_description":"Setu\" means bridge. \"Bandha\" is Lock, and \"Asana\" is Pose or Posture. \"Setu Bandhasana\" means construction of a bridge.",
         "pose_steps":"\n1) Lie in Supine pose (Shavasana) on the floor. Bend your knees and set your feet on the floor, heels as close to the sitting bones possible.\n2) Exhale and, pressing your inner feet and arms actively into the floor, push your tailbone upward toward the pubis, firming (but not hardening) the buttocks, and lift the buttocks off the floor. \n3) Keep your thighs and inner feet parallel. \n4) Clasp the hands below your pelvis and extend through the arms to help you stay on the tops of your shoulders.\n5) Lift your buttocks until the thighs are about parallel to the floor. \n6) Keep your knees directly over the heels, but push them forward, away from the hips, and lengthen the tailbone toward the backs of the knees. \n7) Lift the pubis toward the navel.Lift your chin slightly away from the sternum and, firming the shoulder blades against your back, press the top of the sternum toward the chin. Firm the outer arms, broaden the shoulder blades, and try to lift the space between them at the base of the neck (where it's resting on the blanket) up into the torso.",
         "pose_release":"\n1) Stay in the pose anywhere from 30 seconds to 1 minute. Release with an exhalation, rolling the spine slowly down onto the floor.",
         "pose_benefits":"\n1)Stretches the chest, neck, and spine.\n2) Calms the brain and helps alleviate stress and mild depression.\\3) Stimulates abdominal organs, lungs, and thyroid.\n4) Rejuvenates tired legs.\n5) Improves digestion.\n6) Helps relieve the symptoms of menopause.\n7) Relieves menstrual discomfort when done by support.\n8) Reduces anxiety, fatigue, backache, headache, and insomnia.\n9) Therapeutic for asthma, high blood pressure, osteoporosis, and sinusitis.",
         "pose_precautions":"\n1) Neck injury: avoid this pose unless you are practicing under the supervision of an experienced teacher.\n2) If necessary, place a thickly folded blanket under your shoulders to protect your neck.",
         "pose_links":"https://rb.gy/yzxrig"
      },
      {
         "id":"8",
         "pose_name":"kapalbhati",
         "other_names":"Skull Shining Breath, Frontal Brain Purification, Kapal-Bhati, Kapal-Bharti",
         "pose_description":"The word kapalbhati is made up of two words, kapal meaning skull and bhati means shining, illuminating. Due to the process, the organs under the skull mainly the brain and the small brain are influenced in a good manner.",
         "pose_steps":"\n1) Keep breathing gradually while sitting in Padmasana .\n2) Inhale and start performing Kapalbhati as stated before, that means a strong Rechaka, natural Pooraka and again strong Rechaka and natural pooraka.\n3) Keep on doing this rotation swiftly in rhythmic manner.\n4) Perform as many cycles as possible and then keep breathing gradually. \n5) All these processes are included under one cycle of Kapalbhati.",
         "pose_benefits":"\n1) Helps in cleansing, invigorating, warming, prevents illness and allergies.",
         "pose_precautions":"\n1) The level of common person can go up to 200 repetitions. It is not advisable to increase the number beyond that.\n2) Patients suffering from heart trouble, lung trouble should practice this under an expert guidance.\n3) Those suffering from diseases of blood circulation should perform the process very carefully.\n4) They should perform the process under the guidance and care of experts.",
         "pose_links":"https://rb.gy/6gwlo3"
      },
      {
         "id":"9",
         "pose_name":"Siddhasana",
         "other_names":"Vajrasana, Muktasana, Perfect (Perfected) Posture, Perfect Pose, Adept's posture, Gupta Pose, Accomplished Posture, Sidha Mukta Vajra Asana",
         "pose_description":"One of the most popular meditation postures is Siddhasana. The Sanskrit name means \"Perfect Pose,\" because one attains perfection in yoga by meditating in this position. Siddhasana is useful to learn, since it is used as the practice seat for some of the pranayamas and the mudras.",
         "pose_steps":"\n1) Sit down with both legs outstretched.\n2) Bend the left knee and place the sole of the left foot against the right thigh so that the heel touches the perineum.\n3) Bend the right knee and put the right heel against the public bone.\n4) Keep hands with palms open if done between sunrise and sunset; otherwise reverse the palms.\n5) The spine should always be held erect.",
         "pose_release":"\n1) To exit, slide the right foot forward off the left foot, straighten the right leg and do the same with the left leg, returning back into dandasana.",
         "pose_benefits":"\n1) Siddhasana directs the energy from the lower psychic centers upward through the spine, stimulating the brain and calming the entire nervous system.\n2) Redirects blood circulation to the lower spine and abdomen, toning the lumbar region of the spine, the pelvis and the abdominal organs, and balancing the reproductive system and blood pressure.\n3) Stabilizes and sublimates sexual energy because of the position of the feet with respect to the genitals.",
         "pose_precautions":"\n1) Siddhasana should not be practiced by those with sciatica.\n2) For men who are interested in maintaining sexual relations (ie. with no long term commitment to celibacy), use a soft sitting support to lift the genitals high enough so that the base of the penis is not compressed.\n3) Take care to situate the heels perfectly in the midline.",
         "pose_links":"https://rb.gy/pmhucu"
      },
      {
         "id":"10",
         "pose_name":"Shirshasana",
         "other_names":"Sirsasana, Sirshasana, Sirshasana, Headstand Posture, pole posture Pose, Topsy-turvy Posture, Vipreet Karni Asan/ Mudra",
         "pose_description":"This pose is the most recognized yoga pose than the other poses. Standing on one’s head is called Sirsasana. It is also called the king of the asanas, so one can practice this asana after having mastery in other asanas.",
         "pose_steps":"\n1) Firstly kneel down on the mat. \n2) Then interlock the fingers of your hands and place them and your forearms on the extra padding on the yoga mat.\n3) Keep your elbows close together. \n4) Place the back of your head into the hollow of the palms.\n5) Now, rise up off your knees and take a step or two towards the head.\n6) Inhale, and slowly raise the legs until they are vertical.\n7) Now, keep your back straight and try to relax and breathe deeply and slowly from the abdomen.\n8) Now, concentrate on the brain or the pineal gland between the eyebrows.",
         "pose_release":"\n1) To release or to come down, bend your knees and lower one leg and then the other.\n2) For the beginners, just ask your friend to hold one of your legs while you lower the other leg.",
         "pose_benefits":"\n1) It promotes hair growth by increasing blood circulation in the scalp.\n2) The Shirshasana or the headstand increases the circulation to the brain, due to which we can have improved brain functions and increased vitality and confidence.\n3) Poor blood circulation, fear, sleeplessness, headache, tension, constipation and the problems of eyes and nose can be improved by it.\n4) It also helps to put the spine into correct alignment.",
         "pose_precautions":"\n1) Not for the persons who have high or low blood pressure, atherosclerosis (blocked blood vessels), any history of strokes, serious eye disease, pus in ears, suffering from constipation, suffering from neck injury, or also who have organically defective pituitary.\n2) But after recovering from these diseases you can try do this asana.",
         "pose_links":"https://rb.gy/gkh5he"
      },
      {
         "id":"11",
         "pose_name":"Sarvangasana-1",
         "other_names":"Shoulder Stand, Viprita Karni Asan/ Mudra, Viprit Karani Mudra, Saravanga",
         "pose_description":"This mysterious Asana which gives wonderful benefits. In this Asana the whole weight of the body is thrown on the shoulders. You really stand on the shoulders with the help and support of the elbows. Concentrate on the Thyroid gland which lies on the front lower part of the neck.",
         "pose_steps":"\n1) Lie on the back quite flat. Slowly raise the legs.\n2) Lift the trunk, hips, and legs quite vertically.\n3) Support the back with the two hands, one on either side.\n4) Rest the elbows on the ground. \n5) Press the chin against the chest (Jalandhara Bandha).\n6) Allow the back-shoulder portion and neck to touch the ground closely.\n7) Do not allow the body to shake or move to and fro. Keep the legs straight.",
         "pose_release":"\n1) To release, bring the legs down very, very slowly with elegance and not with any jerks.",
         "pose_benefits":"\n1) It brightens the psychic faculties and awakens Kundalini Sakti, removes all sorts of diseases of intestine and stomach, and augments the mental power.\n2) It supplies a large quantity of blood to the roots of spinal nerves.\n3) It is this Asana which centralises the blood in the spinal column and nourishes it beautifully.",
         "pose_precautions":"\n1) Pregnancy: If you are experienced with this pose, you can continue to practice it late into pregnancy. \n2) However, don't take up the practice of Sarvangasana after you become pregnant.\n3) Not for the persons who have the problem of diarrhea, headache, high blood pressure, menstruation, neck injury.",
         "pose_links":"https://rb.gy/wesrv9"
      },
      {
         "id":"12",
         "pose_name":"Adva-Matsyasana",
         "other_names":"Prone Fish Posture/ Pose, Adho Matsya Asana, Adha Matsy Asan",
         "pose_description":"In this asana posture the shape of the body appears similar to fish in the water. Such a statement is bold, as the fact is, we don't recognize the posture as fish but one can float on the water without any movement in this asana.",
         "pose_steps":"\n1) Lie down on the ground on your back in shavasana .\n2) Now, keep your buttocks on the floor, inhale and raise the head, shoulder, back and the upper arms off the floor arching the back and raising the chest up.\n3) Tilt your head back and place the top of the head flat on the ground.\n4) Now, raise your elbows off the floor and bring your hands up just below your chest and join them at the palms with the fingers pointing straight up (or we can say, in Anjali mudra).\n5) Then breathe gently through the nostrils to remain longer in the pose.",
         "pose_release":"\n1) When you think it’s enough for you or you feel tired then come back to shavasana.",
         "pose_benefits":"\n1) This asana increases the size of the rib cage.\n2) Make the neck flexible and strong.\n3) It widens the wind pipe and thus helps deep breathing.\n4) Good effects on the facial tissue.\n5) Correct the disorders of the spine.",
         "pose_precautions":"\n1) This asana can also be tried with padamasana but the beginners should not do this with padamasana because first one will be easier for the beginners.\n2) The persons who have migraine, high or low blood pressure and serious neck or back injury.",
         "pose_links":"https://rb.gy/4l7s73"
      },
      {
         "id":"13",
         "pose_name":"Ardha-Matsyendrasana",
         "other_names":"Half spinal twist Posture, Half lord of the fishes Pose, Ardho Matseyanrasana, Adha Matsynder Asan",
         "pose_description":"This Asana in its original form is difficult to practice, therefore, it was simplified which is called 'Ardha-Matsyendrasana'. After sufficient practice of this Asana, it becomes possible to practice Matsyendrasana.",
         "pose_steps":"\n1) Sit down on the floor with your legs straight out in front of you and buttocks on the floor.\n2) Bend the right leg at the knee and place the heel tight at the perineum.\n3) Keep the foot of the left leg by the side of the right thigh near the knee.\n4) Now, bring the right hand round the outer side of the left knee passing between the chest and the knee and catch hold of the left big toe.\n5) The right shoulder blade rests on the outer side of the left knee.\n6) Take the left hand round the back and try to catch the right thigh. \n7) Now look back over the left shoulder.\n8) Now, keep your trunk in vertical position and keep in the pose for a while.",
         "pose_release":"\n1) Release the position with an exhalation.\n2) Then come back to the starting position.",
         "pose_benefits":"\n1) It stimulates the digestive fire in the stomach.\n2) Energises the spine and make it flexible.\n3) It relieves the menstrual discomfort, fatigue, and backache.\n4) Also stimulates the liver and kidney and stretches neck, shoulders, and hips.\n5) Helps to cure constipation and reduces the abdominal girth.",
         "pose_precautions":"\n1) Not for the persons who have spine or back injury.",
         "pose_links":"https://rb.gy/sjjnes"
      },
      {
         "id":"14",
         "pose_name":"Supta-Vajrasana",
         "other_names":"The Supine Vajrasana, Pelvic Posture, Fixed Firm Pose, Supta-Vajra-Asana, Supt-Vajr-Asan",
         "pose_description":"his asana is the further development of Vajrasana. 'Supta' in Sanskrit means supine and Vajrasana means lying on the back. We lie on our back with folded legs, hence, it is called Supta-Vajrasana.",
         "pose_steps":"\n1) Lie in Supine pose (Shavasana) on the floor. \n2) Bend your knees and set your feet on the floor, heels as close to the sitting bones possible.\n3) Exhale and, pressing your inner feet and arms actively into the floor, push your tailbone upward toward the pubis, firming (but not hardening) the buttocks, and lift the buttocks off the floor. \n4) Keep your thighs and inner feet parallel. \n5) Clasp the hands below your pelvis and extend through the arms to help you stay on the tops of your shoulders.\n6) Lift your buttocks until the thighs are about parallel to the floor. \n7) Keep your knees directly over the heels, but push them forward, away from the hips, and lengthen the tailbone toward the backs of the knees. \n8) Lift the pubis toward the navel.\n9) Lift your chin slightly away from the sternum and, firming the shoulder blades against your back, press the top of the sternum toward the chin. \n10) Firm the outer arms, broaden the shoulder blades, and try to lift the space between them at the base of the neck (where it's resting on the blanket) up into the torso.",
         "pose_release":"\n1) While returning to the original position, first take out your hands and place it by the side of your body.\n2) Now, with the help of elbows sit as in the first position.",
         "pose_benefits":"\n1) This stretches the thigh muscles and the abdomen.\n2) The stomach is stimulated.\n3 It strengthens the thighs.\n4) Helps those suffering from constipation.\n5) It helps to cure sciatica.",
         "pose_precautions":"\n1) There should never be more than normal pressure on the back, arms, and the ankle joints while doing this exercise.",
         "pose_links":"https://rb.gy/1f8bcb"
      },
      {
         "id":"15",
         "pose_name":"Dhanurasana",
         "other_names":"Bow Posture, Bow pose, Dhanur Asana, Bowposture",
         "pose_description":"This asana actually looks a lot like an archer’s bow when you are in full pose. This is a pose best done after a little warm-up with other poses. It may be difficult for beginners. Bhujangasana, or cobra pose, is a nice pose to start building up the strength required in bow posture.",
         "pose_steps":"\n1) Lie down on your stomach.\n2) Bend your knees and hold the ankles.\n3) Inhale and pull your hands and push with your legs, knees together, till the trunk forms an arc shape with only the stomach on the ground.\n4) Look up and remain in the position for a while.",
         "pose_release":"\n1) Retain breath and then exhale and lie flat.\n2) After releasing, lie in shavasan for a while.",
         "pose_benefits":"\n1)It reduces abdominal fat.\n2) The compressing of the spinal column, pressing the nerves with the scapulae (The winged bones at the back attached to the arms) minimizes blood circulation while in the asan.\n3) When the pose is released a greater supply of blood is endured to those very regions increasing spinal flexibility and definitely raising the vitality. \n4) Good for gastrointestinal, constipation, upset stomach, sluggish liver.",
         "pose_precautions":"\n1) Not for persons suffering from peptic ulcer, hernia, or cases of thyroid or endocrine gland disorders.\n2) Do not try to stay in position if you are feeling too much pain.",
         "pose_links":"https://rb.gy/reir30"
      },
      {
         "id":"16",
         "pose_name":"Majrasana",
         "other_names":"Cat Pose, Billi Posture, Majra Asana, Majr Asan",
         "pose_description":"Cat Pose or Majrasana teaches you to initiate movement from your center and to coordinate your movements and breath. These are two of the most important themes in asana practice.",
         "pose_steps":"\\1) Crouch down, on all fours, like a cat; knees hip width apart, hands shoulder width apart, under your shoulders. Arms remain straight.\n2)Loosen your spine by contracting the abdominal muscles during exhalation, rounding your back towards the ceiling, tucking the tail-bone in and lowering the head with chin towards your chest.\n3) Inhaling, release the contraction, tip the tail bone upwards, dip your spine towards the floor and raise your head. \n4) Expand your chest and complete inhalation.\n5) Alternate these positions several times, coordinating the movements with your breath.",
         "pose_release":"\n1) To release, Come back to the first posture and then relax in a comfortable posture.",
         "pose_benefits":"\n1) This pose will increase the suppleness of your spine, relieve tension in the back and neck area, firm the abdominal muscles and tones internal abdominal organs. \n2) It is a great counterpoise for back bends and exercises the pelvic floor.\n3) The cat pose also benefits people with asthma or heart problems as it expands the lungs.",
         "pose_precautions":"\n1) If you have weak wrists, make fists and put your knuckles on the floor, thumbs forward.",
         "pose_links":"https://rb.gy/5diyof"
      },
      {
         "id":"17",
         "pose_name":"Gomukhasana",
         "other_names":"Cow Face Posture, Cow head Pose, Gomukh Asan, Gomukha Asana",
         "pose_description":"This asana resembles the face of the cow that’s why it is called the 'cow face' or 'gomukhasana'.",
         "pose_steps":"\n1) From Knee to Ankle, slide the knees to center stacking the right knee directly over the left.\n2) It may be helpful to come forward onto the hands and knees to align the knees.\n3) Then separate the feet and come back to sit between the feet.\n4) Bring the left arm up towards the ceiling.\n5) Bend the left elbow, bringing the left hand down the center of the back.\n6) Bring the right arm out to the right side, bend the elbow and bring the right arm up the center of the back.\n7) Hold hands behind the back.\n8) Draw both elbows toward the center.",
         "pose_release":"\n1) Hold the position for four to eight breaths and then come back to the relaxed posture.",
         "pose_benefits":"\n1) It stretches the ankles, hips and thighs, shoulders, armpits and triceps, and chest.",
         "pose_precautions":"\n1) Not for the persons who have serious neck, shoulder or knee problems.",
         "pose_links":"https://rb.gy/w13dnd"
      },
      {
         "id":"18",
         "pose_name":"Akaran-Dhanurasana",
         "other_names":"Bow To the Ear Pose, Bow And Arrow Posture, Akarn-Dhanushtankara, Karna-Dhanurasana, Akarna-Dhanush-Tankara Asana",
         "pose_description":"In this asana the body is stretched more like a string of bow when pulled at the time of archery.",
         "pose_steps":"\n1) Bend the left leg in knee and keep the foot on the thigh of right leg. \n2) Keep the right leg straight.\n3) Hold the big toe of the left leg with right hand; hold it between the thumb and index finger and other 3 fingers to have a good grip of the thumb. \n4) Hold big toe of the right leg with left hand.\n5) Exhale and inhaling start lifting the left foot with the right hand and pull it up to ear. \n6) Keep the trunk and neck erect and the sight fixed on the other end of the left hand.\n7) Continue normal breathing.",
         "pose_release":"\n1) Inhale and exhaling, start bringing the foot down and place it on the thigh.\n2) Restore the hands to their place.\n3) Take the left foot to original position.",
         "pose_benefits":"\n1) In this asana great strain is exerted on hand, legs and joints of waist and the knees. \n2) Consequently the efficiency of the organs increases.",
         "pose_precautions":"\n1) One should avoid the temptation of attaining the ideal position if strain is unbearable.",
         "pose_links":"https://rb.gy/answtz"
      },
      {
         "id":"19",
         "pose_name":"Chakrasana",
         "other_names":"Circle Pose, Full Wheel Posture, Full circle, Purna Chakra Asan, Puma Chakrasana, Up-ward Bow Posture, Back-bend Pose",
         "pose_description":"Chakrasana is the most important and fundamental backbend. In this pose, you have to lie on your back and push up, balancing just on the hands and feet. This pose is called a bridge. A back limber is a skill in which the pose is achieved by bending backward from a standing position.",
         "pose_steps":"\n1) Lie facing upward on the floor.\n2) Bend your knees and set your feet on the floor, heels as close to the sitting bones as possible.\n3) Bend your elbows and spread your palms on the floor beside your head. \n4) Forearms relatively perpendicular to the floor, fingertips pointing towards shoulders.\n5) While inhaling, slowly begin to raise the head, back and buttocks off the floor while arcing the spine.\n6) Hold for the duration of the held inhaled breath.",
         "pose_release":"\n1) When you can’t hold the breath comfortable any longer, slowly exhale and return the back to the floor.\n2) Slide the legs out straight returning to the shavasan.",
         "pose_benefits":"\n1) Strengthens the arms, wrists, buttocks, abdomen and spine.\n2) Stretches the lungs and chest. \n3) Stimulates the thyroid and pituitary.\n4) Increases energy and counteracts depression.\n5) Therapeutic for asthma, back pain, infertility and osteoporosis.",
         "pose_precautions":"\n1) Not for the persons, who have back injury, carpel tunnel and syndrome, diarrhoea, headache, heart problems, high or low blood pressure.",
         "pose_links":"https://rb.gy/k9zagf"
      },
      {
         "id":"20",
         "pose_name":"Matsyendrasana",
         "other_names":"Full spinal twist Posture, Full lord of the fishes Pose, Matseyanrasana, Matsynder Asan",
         "pose_description":"It is a very powerful asana of yoga. In this asana the body is twisted from a sitting position. The twisting of the spine touches on the basic foundation and functioning of the skeleton itself. A flexible mind and an inflexible spine can rarely be found together.",
         "pose_steps":"\n1) Sit on the floor with your legs straight out in front of you, buttocks can be supported on a folded blanket.\n2) Step the right foot over the left leg and stand it on the floor outside your left hip. \n3) The right knee will point directly up at the ceiling.\n4) Exhale and twist toward the inside of the right thigh. \n5) Press the right hand against the floor just behind your right buttock, and set your left upper arm on the outside of your right thigh near the knee. \n6) Pull your front torso and inner right thigh snugly together.\n7) Press the inner right foot very actively into the floor, lengthen through the body and continue to lengthen the tailbone into the floor. \n8) Continue the twist of the torso by turning it to the right.\n9) With every inhalation lift a little more through the sternum, pushing the fingers against the floor to help.\n10) Twist a little more with every exhalation.\n11) Be sure to distribute the twist evenly throughout the entire length of the spine; don't concentrate it in the lower back, i.e. right shoulder rolling back as the left shoulder rolls forward.",
         "pose_release":"\n1) Stay for 30 seconds to 1 minute, then release with an exhalation, return to the starting position, and repeat to the left for the same length of time.",
         "pose_benefits":"\n1) It stimulates the pancreas, liver, spleen, kidneys, stomach and ascending and descending colons. \n2) It is useful in the treatment of diabetes, constipation, dyspepsia and urinary problems.\n3) It tones the nerve roots, and adjusts and realigns the vertebral column. \n4) The back muscles are pulled and stretched in a different direction than usual and this relieves them of tension.\n5) Therefore this asana is recommended in the cases of lumbago, rheumatism and slipped disc.\n6) In fact, it is a powerful yoga asana and its vitalizing effects can be felt quickly.",
         "pose_precautions":"\n1) Women more than 2 or 3 months pregnant should avoid this practice.\n2) People suffering from peptic ulcer, hernia or hyperthyroidism should only practice this pose under expert guidance.\n3) People with sciatica or slipped disc may benefit from this asana, but great care should be taken.",
         "pose_links":"https://rb.gy/iz8zl3"
      },
      {
         "id":"21",
         "pose_name":"Padmasana",
         "other_names":"Lotus Posture/ Pose, Padm Asan, Padma Asana",
         "pose_description":"Padma literally means lotus. This is the posture for meditation. It is the ultimate yoga pose, Padmasana requires open hips and consistent practice.",
         "pose_steps":"\n1) Keep the right foot on the left thigh.\n2) Start bouncing the right knee.\n3) If the bouncing knee easily touches the floor, then bend the left knee, take hold of the left foot with both hands, gently glide it over the crossed right leg and place it on the right thigh.\n4) This will give symmetrical placement of the legs and you are in lotus position.\n5) The hands should be kept on the knees with palms open, and the thumb and second finger of each hand should touch forming a letter O.",
         "pose_release":"\n1) Stay in the position as long as you can and after that release the pose and be comfortable.",
         "pose_benefits":"\n1) It is effective for liver disorder.\n2) This is an extremely good pose for meditation and concentration.\n3) It has a calming effect on the mind and the nerves.\n4) This pose keeps the spine erect.\n5) Helps develop a good posture.\n6) Helps keep the joints in flexible condition.",
         "pose_precautions":"\n1) Those suffering from chronic knee pain should not practice it.\n2) Those getting cramps in calf-muscles should practice it cautiously.\n3) After keeping one leg on the other thigh, if other leg can not be placed fully on the other thigh, do not try to put it forcefully.",
         "pose_links":"https://rb.gy/ggiyzo"
      },
      {
         "id":"22",
         "pose_name":"Simhasana",
         "other_names":"Lion Posture, Tiger Pose, Singh Asan, Singa or Singha Asana, Sinhasana",
         "pose_description":"Placing the palms on the knees, spreading out the fingers (and) opening the mouth wide, one should gaze at the tip of the nose and be well (composed). This Simhasana, adored by ancient yogis.",
         "pose_steps":"\n1) Sit in Vajrasana .\n2) Now raise your buttock a little and cross the heel and toes of the right leg over that of left leg.\n3) Sit on the heels and place both hands on the respective knees. \n4) Spread out the fingers.\n5) Bring out the tongue as much as possible. Gaze should be on Nasal.",
         "pose_release":"\n1) While returning back to the original position, take the tongue in, release the tension, loosen your hands and come back to the original position.",
         "pose_benefits":"\n1) Relieves tension in the chest and face.\n2) An often-overlooked benefit of Simhasana is that it stimulates the platysma, a flat, thin, rectangular-shaped muscle on the front of the throat. The platysma, when contracted, pulls down on the corners of the mouth and wrinkles the skin of the neck. \n3) Simhasana helps keep the platysma firm as we age.\n4) According to traditional texts, Simhasana destroys disease and facilitates the three major bandhas (Mula, Jalandhara, Uddiyana).",
         "pose_precautions":"\n1) If you have a knee injury, always be cautious in flexed-knee sitting positions and, if necessary, sit on a chair to do the pose.",
         "pose_links":"https://rb.gy/wchmtc"
      },
      {
         "id":"23",
         "pose_name":"Hastapadasana",
         "other_names":"Hand to Foot Pose, Foot to hand Forward Bend Posture, Standing Forward bend, Jackknife Pose, Padahastasana, Hasta-Pada Asana",
         "pose_description":"Hastpadasana is one of the twelve basic asanas. You must master this pose and its variations before trying the advanced Asanas.",
         "pose_steps":"\n1) Stand erect and keep both the legs touching each other.\n2) Take a deep breath and keep both the hands up.\n3) Now go on exhaling. \n4) Bend in the front.\n5) Place both the hands on the ground on both the sides of the legs. \n6) Touch the head on the knees. \n7) Do not bend the knees. \n8) Hold the breath outside. \n9) Stand steadily in this bent position.",
         "pose_release":"\n1) Maintain position and suspension of breath 6 seconds.Inhale and then return to the starting position.",
         "pose_benefits":"\n1) Disorders of the belly and digestive system are corrected. \n2) The chest and hands become stronger and you become well balanced, beautiful and good looking.\n3) Diseases of the feet and fingers are also corrected.",
         "pose_precautions":"\n1) Not for the people who have spinal problems, vertigo, hernia, cardiac problem, hypertension, ulcers, myopia.",
         "pose_links":"https://rb.gy/uwrs4o"
      },
      {
         "id":"24",
         "pose_name":"Halasana",
         "other_names":"Full Plough Posture, Full Plow Pose, Purn Hal Asan, Purna Hala Asana",
         "pose_description":"Halasana is repose, to assure maximum benefit. It consists in lying an instant on the back, then lifting the legs (firm) slowly over the trunk, helping to incline them with the pressure of the hands against the floor, to both sides of the head, the body forming a perfect arch.",
         "pose_steps":"\n1) From the shoulder stand pose, bring your feet at an angle above your head.\n2) Bring your hands behind your back to support and control the descent.\n3) If possible bring gently the toes to the floor keeping your knees straight. \n4) Once the feet touch the floor bring your arms flat on the floor with palms down touching the floor.\n5) For more advanced students, interlock the fingers keeping your hands in contact with the floor.\n6) Try breathing as comfortably and rhythmically as possible.\n7) If you do not have the necessary flexibility to do the full posture, it is okay to keep your feet up in the air and to let your knees be bent as required by your back muscles. \n8) Hold the asana from a few seconds to one minute.",
         "pose_release":"\n1) To come out of the posture, lift your feet up to a 45 degree angle, bring your palms flat on the floor and slowly bring your back, hips, legs and feet onto the floor paying attention to keep the head and shoulders on the floor.\n2) Relax on your back.",
         "pose_benefits":"\n1) Brings fresh blood to the throat and thyroid gland.\n2) Locking of the chin massages the thyroid gland.\n3) Extends the cervical section of the spine giving it a powerful stretch. Same to the rest of the spine as well as hamstrings and calves.\n4) During the inhalation intense pressure is applied to the abdomen giving a good stimulation to the digestive system.\n5) Opens up the shoulder joints.",
         "pose_precautions":"\n1) You should not do halasana if you have any neck problems. \n2) If you suffer from \"rounded shoulders\" a.k.a. kyphosis, do not stretch too far and do not hold the posture too long. \n3) Consult your doctor or chiropractor before practicing.",
         "pose_links":"https://rb.gy/waigyx"
      },
      {
         "id":"25",
         "pose_name":"Vajrasana",
         "other_names":"Thunderbolt Posture, Adamantine Pose, Vajra Asana, Vajr Asan",
         "pose_description":"Like Padmasana, this is also the Asana for meditation. One can sit comfortably for a prolonged period in this Asana. This is one asana which can be done immediately after consuming food. Sit in Vajrasana and do right nostril breathing.",
         "pose_steps":"\n1) Sit with legs extended together, hands by the side of the body, palm resting on the ground, fingers of the hands together pointing forward.\n2) Fold the right leg at the knee and place the foot under the right buttock. \n3) Sole will remain inside.\n4) Similarly folding the left foot, place it under the left buttock.\n5) Hands resting on the respective thighs.\n6) Sit erect, gaze in front and then close the eyes.",
         "pose_release":"\n1) While returning to the original position, bend little towards right side take out your left leg and extend it.\n2) Similarly extend your right leg and return to the original position.",
         "pose_benefits":"\n1) Relaxes your kneecaps, knees, ankles and feet, improves digestion and reduces gas.\n3) Relieves sciatica pain. 'Vajrasana', if done for 10 minutes after a full meal relieves heaviness in stomach due to overeating.",
         "pose_precautions":"\n1) While sitting on the bent feet, the heels should remain out and toes inside. Soles upward.\n2) Do not sit on the heels.",
         "pose_links":"https://rb.gy/dweve0"
      },
      {
         "id":"26",
         "pose_name":"Yoga-Mudra",
         "other_names":"Psychic union Pose, Psychio-union posture, Yog-Mudra Asan, Yogmudra Asana",
         "pose_description":"The word “Yogamudra” is derived from the two words – yoga (awareness) and mudra (seal). Yogamudra thus is the “seal of awareness”. It ensures that you attain the highest stage of awareness.",
         "pose_steps":"\n1) Sit in Lotus Posture. \n2) Bring your hands behind your back.\n3) Inhale deeply. \n4) Exhaling slowly, bend forward.\n5) Exhale deeply. \n6) Come back to the sitting position inhaling slowly.\n7) Again Sit in Lotus Posture by changing the leg crossed the other way. \n8) This time, hold the other wrist with the opposite hand.",
         "pose_release":[],
         "pose_benefits":"\n1) Stretches the posterior muscles of the trunk and the neck. \n2) Improves muscle tone and venous circulation of the spinal column. \n3) Favourable effects on the viscera due to deep intra-abdominal compression. \n4) Lateral stretch stimulates vital areas of the colon. \n5) Acceleration of the venous flow from the sex organs has a favourable effect. \n6) The compression of the diaphragm and the abdominal walls provide massage to the abdominal contents useful in gastric conditions. \n7) Ascending and descending colon gets good pressure thereby alleviating constipation. \n8) Helps prevent sagging of uterus and postnatal laxities. \n9) Lumbar pain is alleviated. \n10) Overall, improves the health of the abdomen and pelvic organs due to good blood circulation and drainage.",
         "pose_precautions":"\n1) Spinal injury and abnormalities, severe back problem and cervical and lumbar spondylosis. \n2) Hypertension, serious cardiac conditions, high BP, hernia and high myopia. \n3) Acute and resolving disc prolapsed (slip disc), acute pain of neck and back, the stiffness of back and joints, bulging tummy.",
         "pose_links":"https://rb.gy/kubqrf"
      },
      {
         "id":"27",
         "pose_name":"Shavasana",
         "other_names":"Corpse Posture, Most-relaxed Pose, supine posture, Savasana, Shav Asan, Sava Asana, Shava Mudra, Mritasana, Mrita, Mrit, Dead pose",
         "pose_description":"We can truly get in touch with the deepest of Anahata Chakra through Shavasana. In this asana, as we release the whole of the body into the ground and allow the full effect of gravity to flow through us then we restrain and retain Vayu Tattva.",
         "pose_steps":"\n1) Lie flat on your back,Legs should be separated.\n2 ) Keep your arms at your side and your palms facing up. Just relax.\n3) Close your eyes and breathe deeply and slowly through the nostrils.\n4) Start concentrating from your head to your feet. \n5) Don’t move ahead without relaxing particular part of the body.\n6) On each inhaling and exhaling (breathing) think that your body is totally relaxed. \n7) Let your tension, stress, depression and worry run away on each exhaling. \n8) You can practice this asana for about 3–5 minutes.",
         "pose_release":[],
         "pose_benefits":"\n1)  Savasana improves blood circulation. \n2) It helps in reducing stress.\n3) Savasana boosts energy.\n4) Relaxes your muscles.\n5) Savasana helps reduce headaches.\n6) Beneficial for those suffering from diabetes & indigestion",
         "pose_precautions":"\n1) Constantly create shavasana earlier than practicing other yogasana and following ending yogasana.\n2) That judgment hard to practice in the morning otherwise evening can do whereas resting at night.\n3) Focus is significant.\n4) Whereas practicing shavasana, if you experience drowsy otherwise sleepy you can respire a bit faster and deeper. \n5) Benefits of shavasana not only limit you to relaxing your body and mind, but it also has a huge part to play in your sleep. \n6) If you experience insomnia as such, you can easily try this yoga before hitting the bed. \n7) However, one should never fall asleep whilst doing the yoga which would hamper the gentle balance between relaxation and controlling your breathing.",
         "pose_links":"https://rb.gy/juj8wl"
      },
      {
         "id":"28",
         "pose_name":"Parvatasana",
         "other_names":"Seated Mountain Pose, Seated Hill Posture, Parvata Asana, Parvat Asan",
         "pose_description":"In this the body is stretched to look like a mountain peak and so it is called the Parvatasana (parvat means mountain in Sanskrit).",
         "pose_steps":"\n1) First, sit on the floor in Dandasana Position (staff pose) with legs stretched in front of you and hands kept freely beside the body.\n2) Now, sit in the action of Padmasan means that your right leg is on the left thigh and the left leg is on the right thigh. (cross-legged pose)\n3) After this, inhaling slow and deep about 3 seconds and join the palms in namaskar mudra and stretch the hands upward over the head.\n4) Now pull the body and hands well upwards with keeping your hips on the floor and feel the deep stretch in the body. \n5) Maintain the final pose for 30-40 seconds.\n6) With the breathing normally and then release the pose and slowly return to the starting pose.",
         "pose_release":[],
         "pose_benefits":"\n1) The health benefits of Parvatasana is improving body balance and posture.\n2) The practice of Seated Mountain Pose works to the spine and straightens the muscles of the back and enhances the functioning of the internal organs. \n3) When you practice this regularly, then your body becomes strong and the looseness of the body also removes.\n4) Parvatsana also removes tension in the shoulders and back.\n5) This asana benefits both men and women alike, and full benefit can be obtained in the disease of premature ejaculation.\n6) Parvatsana is very effective for the strength of the shoulders. And the power of the legs also increases.\n7) Apart from that, this pose also activates the heart chakra which helps one to feel sensations of deep love and peace.\n8) There is no better way to get rid of lungs or respiratory diseases than emigration.\n9) To overcome uterine diseases and to eliminate the flexibility of the skin after pregnancy, one should do it.\n10) A person who has the disease of early degeneration must do this asana. \n11) According to experts, this disease is curing by this asana.",
         "pose_precautions":"\n1) Parvatsana may be good for your health, but here are some precautions that Anantasana will bring about.\n2) Don’t practice this pose’s full extension in case you have carpal tunnel syndrome since it places much stress on hands and the wrists. Rather, modify this posture by resting the forearms on the ground instead of holding your body up with the hands.\n3) When you do this asana, you should not be bowed down at your hands, keep your waist and hands fingers straight.\n4) During practice, if you find any pain or discomfort, please exit the pose and ask for the expert’s guidance and doctor’s advice.",
         "pose_links":"https://rb.gy/shz6un"
      },
      {
         "id":"29",
         "pose_name":"Trikonasana",
         "other_names":"Triangle Posture, Trikon Asan, Trikona Asan, Side Bend Pose",
         "pose_description":"Trikonasana, the Triangle Pose, concludes the yoga postures in our Basic Session. It augments the movement of the Half Spinal Twist Yoga Pose and gives an excellent lateral stretch to the spine, toning the spinal nerves and helping the proper functioning of the digestive system.",
         "pose_steps":"\n1) Move the legs 3-4 feet distance apart. Raise both the arms straight out to the sides, in line with the shoulders and parallel to the floor with the palms facing downwards.\n2) Move the right foot to the outside direction. Turn the left foot slightly to the inward direction. The knees must remain straight throughout the practice.\n3) Slowly begin to bend the trunk towards the right side. Make sure the body doesn’t go in the forward direction.\n4) Once the trunk is completely bent the hand must be close to the right ankle with the fingers slightly touching the floor. \n5) Ideally the right palm rest on the floor. Avoid forcing this position as with regular practice it comes easily on the floor.\n6) Stretch the left arm vertically. Move the head in the upward direction and look straight.               \n7) Hold the position for a minute or half or even lesser in the beginning. Gradually increasing the time as you begin to feel more comfortable.\n8) To return, lift the arms first and then slowly move the trunk back in the upright position. Relax the body.Practice this asana 1-3 times on both the sides.",
         "pose_release":"\n1) Stand upright keeping the spine erect, head straight, feet together with big toes and heels slightly touching each other. Hands to the side of the body. \n2) The weight of the body should neither be on the heels nor on the toes but distributed evenly on both of them. \n3) Relax and take deep breaths.",
         "pose_benefits":"\n1) Stretches and strengthens the thighs,  knees, and ankles. \n2) Stretches the hips, groins, hamstrings, and calves; shoulders,  chest and spine. \n3) Stimulates the abdominal organs. \n4) Helps relieve stress. \n5) Improves digestion. \n6) Helps relieve the symptoms of menopause.",
         "pose_precautions":"\n1) Don’t overstretch the body while practicing this asana as it may cause unnecessary pain or injury.\n2) If the neck begins to hurt in the upward direction, slightly lower it.\n3) Avoid practicing this asana in case of severe pain in the neck, back or shoulders.\n4) People suffering from any of these conditions should avoid practicing this asana: any kind of injury in the knee, arthritis, vertigo, spinal disorders, high blood pressure, breathing trouble, migraine, heart problem or cervical spondylitis.",
         "pose_links":"https://rb.gy/r0poxt"
      },
      {
         "id":"30",
         "pose_name":"Mayurasana",
         "other_names":"Peacock Posture, Pea-Cock Pose, Mayura Asana, Mayur Asan",
         "pose_description":"It is a classic yoga posture that is highly recommended if you want to improve the radiance of your skin, the tone of your muscles and the workings of your inner organs. In this asana one has to hold his whole body like a stick on both his elbows.",
         "pose_steps":"\n1) Start the pose by gently sitting on the heels. Keep your knees wide apart.\n2) Keep your hands on the floor and point the fingers towards your body. Bend your elbows gently and slowly press them towards the abdomen.\n3) During the pose, you should always keep the belly firm. This is something that you can do by dropping your head on the floor and enhancing the strength of your stomach.\n4) Stretch out your legs while making sure that your knees remain straight. You should also keep the upper part of the feet facing the floor.\n5) Keep your shoulder blades firm and push them into the back. Raise your head and tighten your buttocks. \n6) Keep your gaze forward.\n7) Slowly shift the weight of your body forward while lifting the legs right off the floor. Make sure you’re your body is lifted with its weight balanced on the hands. \n8) You should keep your body parallel to the surface of the floor.\n9) Stay on this pose for about ten seconds at the initial stages. With more practice, you can to hold on to the pose for up to 1 minute.",
         "pose_release":[],
         "pose_benefits":"\n1) According to the Gheranda Samhita, Mayurasana can help in removing toxins from the body. It can detoxify the body and remove fevers and tumors.\n2) Mayurasana energizes the stomach, pancreas, spleen, liver, kidneys, and intestines.\n3)The asana tones digestive organs and also increases blood circulation within the abdominal area, thus enhancing its strength.\n4) The yoga asana tones and strengthens the reproductive system, thereby reducing all menopause and menstrual dysfunctions. Mayurasana can also enhance sexual activity.\n5) It can also assist in fighting piles and diabetes.\n6) It can help in improving posture.\n7) The asana helps to calm the restless mind and greatly reduce anxiety and stress.\n8) Practicing Mayurasana helps to boost the strength of the shoulders, wrist, elbows, and spine.\n9) It improves focus and concentration and also the coordination between mind and body.",
         "pose_precautions":"\n1) Do not practice Mayurasana if you already have a wrist, elbow or shoulder injury.\n2) You should strictly avoid Mayurasana if you have high blood pressure; heart diseases; intestinal problems; a hernia; eye, nose and ear infections or brain tumor.\n3) Pregnant and menstruating women should not practice Mayurasana.\n4) If you are not feeling well while practicing Mayurasana, immediately come out of the pose.\n5) Now that you have learned about the various steps associated with Mayurasana, go ahead and practice it to attain the maximum benefits.",
         "pose_links":"https://rb.gy/aw5rdv"
      },
      {
         "id":"31",
         "pose_name":"Mandukasana",
         "other_names":"Frog Pose, Froggy Posture, Manduka Asana, Manduk Asan",
         "pose_description":"The shape of this formation resembles a frog, so that’s why this asana is called Mandukasana. In sanskrit frog is called a manduk.",
         "pose_steps":"\n1) Sit in Vajrasana.\n2) Now, make fists where thumbs should be inside.\n3) Put the fists at the naval region.\n4) Inhale deeply.\n5) With exhale bend forward and put maximum pressure on the naval area. \n6) While bending forward, your chest should touch your thigh and see ahead with open eyes just like as frog.\n7) Maintain the pose as long as you can do.\n8) Inhale-exhale slowing while maintaining the pose.\n9) Come to Vajrasana with deep inhale.\n10) Perform it 3 to 5 times.",
         "pose_release":[],
         "pose_benefits":"\n1) massages the entire abdominal organs. Thus, good for smooth functioning of these organs.\n2) It controls weight. Thus effective for those who are longing for weight loss and making the stomach flat.\n3) It is beneficial in case of constipation and indigestion.\n4) It is helpful to release unwanted gases from the stomach thus make you feel relaxed and calm.\n5) It helps to control diabetes by stimulating the pancreas.\n6) Dislocated naval can be corrected by performing this asana.\n7) It should be practiced by those who have asthmatic condition.\n8) It strengthens the back if practice technically right. \\m9) It is good for chest and shoulders.\n10) Regular practicing the asana is helpful to minimize the impact of menstrual cramps.\n11) It can be practiced to relieve stress, anxiety and depression.\n12) In traditional texts, it has also been said that the asana helps to awakening of Kundalini.",
         "pose_precautions":"\n1) It shouldn’t be performed by those who has backache\n2) It shouldn’t be practiced who has ulcer.\n3) Knee pain patients should avoid it.\n4) Don’t put maximum stretch on your stomach; try to maintain the pose for longer period of time.\n5) Avoid if having ankle injuries.\n6) High blood pressure\n7) Insomnia\n8) Migraine",
         "pose_links":"https://rb.gy/3dvhdw"
      },
      {
         "id":"32",
         "pose_name":"Sitali",
         "other_names":"Tongue Hissing, Cooling Breath",
         "pose_description":"This exercise is also one of the basic breathing exercises. The breathing technique Sitali refers to the sound caused when air is drawn in through the protruding tongue folded into a tube.",
         "pose_steps":"\n1) Sit in front of yoga mat at any meditative posture like Padmasana, Sukhasana or in Vajrasana with head, neck, and spine erect in one line. \n2) Also, to make practice more effective, you can make Gyan Mudra with your hands.\n3) Breathe in deeply 2-3 times with your mouth open, and exhale from the nose to prepare for the sitali breathing.\n4) Bring out your tongue while curling it on sides towards the center to form a tube-like shape.\n5) Now inhale through the tube-form tongue and towards the end of inhalation, lower your chin to the chest in ‘Jalandhara Bandha’. \n6)  At this point, hold your breath for 6-8 secs.\n7) Before exhaling, lift up your chin, withdraw your tongue & close your mouth. \n8) Now exhale completely through your nostrils. \n9) This completes one round sitali breathing.",
         "pose_release":[],
         "pose_benefits":"\n1) A research 1 done on the effect of Sitali along with sitkari pranayama on Brain waves has shown, it increases the alpha, delta, and theta waves power and decreases beta wave power.\n2) Where alpha waves bend mostly seen in the calm and quiet brains, beta waves observed in mind full of fear and anxiety.\n3) It relieves you from stress & anxiety through its soothing & relaxing effect.\n4) It also helps reduce fever by bringing down body temperature.\n5) Do this when you feel hot during summers to cool down.\n6) It helps calm down hunger and thirst in an emergency situation.\n7) Its repetitions 3-4 times a day can help bring down overall body temperature by 3 to 4% during summers.\n8) It also helps in lowering blood pressure.\n9) Sitali Pranayama is very useful for people suffering from Insomnia. Its regular practice will help cure them of insomnia.\n10)It is very helpful for people suffering from a sleep disorder. It helps them relax and sleep well for up to 8 hours at night.",
         "pose_precautions":"\n1) For the effective results out of this breathing exercise, it’s preferred to practice it in empty stomach.\n2) Make sure your back and neck are not bent or curved as it restricts the Prana flow within the subtle body.\n3) Unlike other pranayamas, avoid doing Sitali. \n4) Pranayama during winters and extreme cold weather as it could induce respiratory problems in your lungs\n5) Those having heart ailments should consult a doctor or an experienced Yoga trainer before trying to do Sitali Pranayama.",
         "pose_links":"https://rb.gy/dg52ix"
      },
      {
         "id":"33",
         "pose_name":"Katti-Chakrasana",
         "other_names":"Waist Rotating Pose, Waist rotation posture, Katti-Chakra Asana, Kati-Chakrasana, Kati Chakr Asan, Kati-Chakrasana, KatiChakrasana",
         "pose_description":"This also a simple yet effective and safe posture which almost any one can practice to mainly exercise the trunk. Its easily controllable circular movement is a good remedy for back pains.",
         "pose_steps":"\n1) Begin with Tadasana, stand straight keeping your feet comfortably apart.\n2)  Inhaling, stretch both arms front of the chest with your palms are facing each other. Distance between the arms should remain constant.\n3)  Rotate your waist to the right swinging your arms as far as possible while exhaling. Check your breath and maintain this pose as long as you can. Bring your arms before the chest while inhaling.\n4)  Now rotate your waist to the left swinging your arms as far as possible while exhaling. Check your breath and maintain this pose as long as you can. Bring your arms before the chest while inhaling.\n5)  This is one cycle. Perform minimum 5 cycles at a time.",
         "pose_release":[],
         "pose_benefits":"1) Healthy maintenance of the spinal column.\n2) Regular practice of Katichakrasana burns waist and abdominal fat. Enjoy slim, supple and flexible waist. If you are worried about belly fat, practice Katichakrasana everyday and lose fat (weight) in the abdominal region.\n3) Flexible spine, neck and back muscle - contraction and expansion in the neck, back, waist and abdominal region massages and tones the muscles in these regions massaging the entire vertebral column.\n4) Improves bowel movement, helps cure indigestion and constipation.\n5) Strengthened shoulders, neck, arms, back and thighs.\n6) While rotating the waist and moving the arms in the same direction, chest expands and oxygen fills the lungs. This yoga pose helps combat asthma, cough, tuberculosis, etc.\n7) Eases muscular stiffness and rigidity – people suffering from Parkinson’s and Alzheimer diseases and those with frozen shoulder will be highly benefited.\n8) Regulates the production of pancreatic juice, controls diabetes by improving the efficiency of pancreas.\n9) Improves kidney efficiency, nervous system, helps fight depression by releasing pranic energy and elevating mood, stimulates Manipura Chakra, cures uterus problems, strengthens lumbar region, strengthens arms and leg muscles, and more.",
         "pose_precautions":"\n1) Don’t practice Katichakrasana if you are pregnant.\n2) People with hernia, slip disk, spinal injuries, cervical spondylitis and those who have gone through abdominal surgery recently should avoid this asana.\n3) If you have high blood pressure, be cautious while practicing Katichakrasana. This practice may cause giddiness and faintness in you.",
         "pose_links":"https://rb.gy/a5vzcb"
      },
      {
         "id":"34",
         "pose_name":"Tadasana",
         "other_names":"Mountain Pose, Hill Posture, Tada Asana, Tad Asan,",
         "pose_description":"Tadasana can be practiced as a starting position for standing poses, in between standing poses, or by itself to improve posture. Tadasana is a position used at the beginning and in the middle and in the end, in which you pay attention to your position, your concentration and your breathing.",
         "pose_steps":"\n1) Stand straight and keep some distance between feet.\n2) Hands should be hanging alongside your body.\n3) Now while deep inhaling raise your both the arms upwards and interlock your fingers.\n4) Raise your heels and stand on your toes. Feel the stretch in your body from feet to fingers of arms.\n5) Hold this position and your breath for 10 seconds.\n6) Now while exhaling release your pose to come to the starting position.\n7) Repeat this cycle for 10 times.",
         "pose_release":[],
         "pose_benefits":"\\1) One of the best yoga poses to increase height.\n2) Stimulates nervous system.\n3) Improves body posture and balance.\n4) Regulate the menstrual cycle in women.\n5) Tone your buttocks and abdomen.\n6) Strengthens your ankles, knees, thighs, arms, and legs.\n7) Improves the function of the respiratory and digestive system.",
         "pose_precautions":"\n1) Those who are suffering from insomnia, low blood pressure or a headache should not practice tadasana yoga pose.\n2) Should not practice during pregnancy.",
         "pose_links":"https://rb.gy/uuhcrh"
      },
      {
         "id":"35",
         "pose_name":"Vakrasana",
         "other_names":"Twisting Posture, Twist Pose, Vakra Asana, Vakr Asan",
         "pose_description":"In this asana, the upper part of the body is completely turned and twisted. The spine, the muscles of the hands, the legs and the back are stretched.",
         "pose_steps":"\n1) Sit on the mat with your legs stretched out in front of you.\n2) Keep your hands parallel to hips or thighs with palms resting on the floor.\n3)  Bend your left knee at 90 degrees with knee pointing towards the sky, placing the left foot near your right knee. \n4) Bring your right hand forward, place it on the outer side of your folded left knee while twisting your waist. \n5) Note that your right elbow should be touching the left knee. Now hold your left ankle with your right hand.\n6)  Turn your head to your left and place your left hand flat on the floor, just behind the hip. Hold this position for a count of 30 and breathe normally.\n7) Now release your hand holding the right ankle and your left twist, turn your head and stretch your legs.\n8) Keep your palms on the mat in a relaxed position and rest for 10 seconds.\n9) Repeat the same for the other side.",
         "pose_release":[],
         "pose_benefits":"\n1) It stimulates the pancreas and is therefore beneficial for people with diabetes\n2) It helps reduce belly fat\n3) It relieves the stiffness of the spine\n4) It helps with proper secretion of stomach acid, which helps correct digestion problems\n5) It helps in relieving symptoms of constipation and liver weakness\n6) It increases elasticity of the spine and makes it supple\n7) It tones spinal nerves\n8) It strengthens back muscles and reduces back ache",
         "pose_precautions":"\n1) Our yoga expert has adapted these poses to suit diabetics. Sometimes, diabetics have restricted range of movement, due to obesity or overall stiffness. \n2) The poses demonstrated have been adapted to make room for these restrictions. \n3) So go ahead and start gently. If you have never done yoga before or have some other complication due to which your doctor has restricted your movement, do check with him/her before you begin.",
         "pose_links":"https://rb.gy/bljyju"
      },
      {
         "id":"36",
         "pose_name":"Paripurna-Navasana",
         "other_names":"Full Boat Posture, Purna Nauka, Noka, Asan Nav Asana, Boat Pose",
         "pose_description":"Although this asana is done on the floor, but actually it is a challenging balancing pose (the balance is on your buttocks). The complete posture looks like a boat, and since you are balancing like a boat balances in the water.",
         "pose_steps":"\n1) Sit with your knees bent, feet on the floor. Place your hands behind your knees, lift the chest, engaging the back muscles as you inhale\n2) Engage your inner thighs and draw your lower belly in and up\n3) Tip back on the back of your sitting bones and lift your feet up to about knee height, toes spread out\n4) Bring your arms parallel to the floor\n5)To go further, straighten your legs\n6) Stay for 2-5 breaths, work up to 10 breaths\n7) To come out of the pose, on an exhalation bring your feet down, and sit with a straight spine, holding on to your legs for a couple of breaths",
         "pose_release":[],
         "pose_benefits":"\n1) Strengthens core, hip flexors and spine\n2) Improves digestion",
         "pose_precautions":" In the following conditions, navasana should be avoided or one should consult a expert before practicing it.\n1) Hernia\n2) Spinal injuries\n3) Blood pressure\n4) Asthma\n5) Heart patients\n6) Pregnancy\n7) Hip joint pain\n8) Migraine\n9) Diarrhea\n10) Heart problems\n11) Insomnia\n12) Neck injury",
         "pose_links":"https://rb.gy/fe0ftq"
      },
      {
         "id":"37",
         "pose_name":"Uddiyan-bandha",
         "other_names":"Uddiyan-Bandh, Udiyana, Udiyan, Abdominal Lock",
         "pose_description":"This bandh involves movement of the muscles of the stomach and especially the muscles of the diaphragm. The movement is important and characteristic. Hathayoga assigns a special importance to Uddiyan Bandh. The study of Pranayam is not complete without studying this bandh.",
         "pose_steps":"\n1) Standing Position\n2) Firstly, stand and keep your spine straight.\n3) Then, bend your knees slightly, keep around a feet distance between them.\n4) Now, slightly lean forward and put your hands on thighs, just above the knees.\n5) Take a couple of breaths and relax.\n Sitting Position\n6) Sit in a Yoga Asana such as Padmasana or Siddhasna. Get comfortable with the asana.\n7) Place your hands on the lower thighs, just above the kneecap.\n8) Take a couple of deep breaths to let a proper flow of prana throughout the body.\n9) Now you have to focus on your abdomen and perform the following steps.\n Steps to Perform Uddiyana Bandha\n10) Exhale the breath completely, and hold it.\n11) Now, draw the navel part in and try to touch your spine, then lift it towards your ribcage or heart’s center, holding the breath.\n12) Hold it for a few seconds, according to your comfort the drop it gently.\n13) Do this all process simultaneously.",
         "pose_release":[],
         "pose_benefits":"\n1) Uddiyana Bandha mainly uses the muscles of the abdominal region. It is like an exercise for the abdomen muscles. As a result, it strengthens the abdominal muscles and diaphragm.\n2) This practice massages the abdominal muscles heart and the lungs that result in a better function of these muscles. It increases digestive fire in the body. As a result, it improves digestion and purifies the toxins from our body.",
         "pose_precautions":"\n1) If you are suffering from high blood pressure problems, you should not go for Uddiyana Bandha. \n2) Practicing it can increase your blood pressure rapidly.\n3) The patients of ulcer and hernia are not suggested to perform Uddiyana Bandha.\n4) During pregnancy, a woman should not practice this Bandha. It can have an adverse effect on the health of unborn and mother, both.\n5) In mensuration cycles, one should not practice Uddiyana Bandha.\n6) You should perform it empty stomach, if you’ll perform this just after a meal, this can cause stomach pain and indigestion.\n7) Don’t go much hard on your body. Ones you have reached your limit, you can release yourself. Going beyond the limit can be damaging to your health.",
         "pose_links":"https://rb.gy/u3pgl5"
      },
      {
         "id":"38",
         "pose_name":"Virasana-2",
         "other_names":"Hero Posture/ Pose 2, Veera or Vira Asana, Veer or Vir Asan, Veerasana",
         "pose_description":"Vira means brave. The way a brave man takes position while attacking his enemy, the similar position is formed in this asana, hence it is called as Virasana.",
         "pose_steps":"\n1) Start the pose by kneeling down. Spread your feet apart to sit between them.\n2) Do not sit ON your feet. Keep your feet outside your hips. Your toes should be pointing backward, and your feet’s tops should be pressing onto the floor.\n3) Do not keep your knees wider than your hips. Now lie down on your back slowly by first using your hands, then your elbows.(If you feel pain or discomfort in your back or knees, then stop practicing the pose.)\n4) Hold this pose for 20-30 seconds. Then raise your body slowly, using your hands to come back to the starting position.",
         "pose_release":[],
         "pose_benefits":"\n1) Improves your digestion greatly\n2) Relaxes the muscles of your legs and knees\n3) Relieves tired legs\n4) It also cures several medical conditions like Insomnia, Infertility, Headache, Flat Feet, Acidity, Diarrhea, Arthritis, High Blood Pressure, and Gastritis\n5) Relieves menstrual pain\n6) Stretches your abdomen, thighs, and your ankles\n7) Supta Virasana strengthens your arches\n8) Relieves Sciatica",
         "pose_precautions":"\n1) Do not eat anything before doing any yoga pose. \n2) Always practice yoga on empty stomach only.\n3) Use props like blocks, straps and bolsters if you’re a beginner or have difficulty in doing it.\n4) Don’t practice Supta Virasana if you have knee or ankle injury.\n5) Consult a doctor if you have a history of severe back, ankle or knee problems.\n6) Do not keep your knees wider than your hips.",
         "pose_links":"https://rb.gy/3white"
      },
      {
         "id":"39",
         "pose_name":"Ushtrasana",
         "other_names":"Camel Pose, Ustrasana, Unt or Unth Posture, Ustra or Ushtra Asana",
         "pose_description":"The word “ushtra” refers to “Camel”. In this asana, the body resembles the neck of a camel, that's why it is called 'Ushtrasana'.",
         "pose_steps":"\n1) Starting Position: Vajrasana\n2) Stand on the knees. Keep the thighs fully straight.\n3) Keep the knees and feet together. But if one feels more comfortable with maintaining a little distance between them, they may do so.\n4) Lean in the backward direction. Slowly move more backward. Reach the right heel with the right hand, and the left heel with the left hand. Avoid straining the body.\n5) Push the hips in the forward direction. The thighs should be kept vertical.\n6) Then bend the head and the spine as backward and as farther as possible without straining.\n7) Relax the body and the muscles of the back.\n8) Support the body weight equally on the legs and arms.\n9) Keep the arms in such a way that they anchor the shoulders to maintain the back arch.\n10) Stay in the same position for as long as you find it comfortable.\n11) Then release the hands from the heels one by one and return to the starting position. Relax and take deep breaths.\n12)  Practice 3 times, must be followed or proceeded by a forward bending asana such as Paschimottanasana (Seated Forward Bend).",
         "pose_release":[],
         "pose_benefits":"\n1) Helpful in getting rid of all kinds of back pain.\n2) Stimulates the functioning of the thyroid gland.\n3) Makes the neck, back, chest and abdominal regions flexible.\n4) Stretches pelvic region thus helpful in getting rid of menstrual discomforts.\n5) Improves digestion and reduces excess fat deposited on the stomach, neck and back.\n6) Activates the brain cells and makes it function better by improving the blood circulation.\n7) Beneficial for curing the diseases related to the respiratory system such as Bronchitis and Asthma.",
         "pose_precautions":"\n1) Breath normally throughout the practice. Avoid long and deep breaths as the chest is already stretched during this asana and taking long, deep breaths may create discomfort in breathing.\n2) Beginners after practicing Ustrasana may feel dizzy for a while. It may also cause nausea as well but that’s very rare.\n3) People suffering from high or low blood pressure should avoid practicing this asana.\n4) People suffering from insomnia should avoid this asana.\n5) Ustrasana should be avoided by people having any back injury or pain in the neck.\n6) Ustrasana is not recommended for people suffering from a migraine.",
         "pose_links":"https://rb.gy/hs6gvj"
      },
      {
         "id":"40",
         "pose_name":"Tiriyaka-Tadasana",
         "other_names":"Side Bending Stretch Pose, Swaying Palm Tree Pose, Tiriyaka-Tada-Asana, Triyak-Tad-Asan",
         "pose_description":"Tiriyaka-Tadasana is a swaying tree stretch. This pose can be seen in trees when wind is blowing.",
         "pose_steps":"\n1) Starting Position: Tadasana (Mountain Pose)Variation 1\n2) Tiryaka Tadasana (Swaying Palm Tree Pose) steps, precautions benefitsDistance your legs shoulder-width\n3) Interlock the fingers of both of your hands with the palms facing outward direction.\n4) While inhaling, slowly raise the arms bringing them over the head. Now the palms must be facing upwards.\n5) Stretch the arms in the upward direction, they should be slightly touching the ears.\n6) While exhaling, slowly begin to lower the torso to the right side of the body as far as can comfortable.\n7) Keep the arms straight. You will feel a good stretch on the left side of your waist.\n8) Retain this position for a few seconds.\n9) To return, exhale and slowly move the torso to the upright position. Lower the hands and release the interlock.\n10) Relax the body taking long and deep breaths. Practice from opposite side.\n11) Practice 3 times with each side alternately.\n Variation 2\n12) Balance the body on toes before bending sideways in this variation.Tiryaka Tadasana (Swaying Palm Tree Pose) steps, benefits Image Source\n13) Precautions for Tiryaka Tadasana (Swaying Palm Tree Pose)\n14) It is recommended to begin a yoga practice in the presence of a competent yoga teacher/instructor.\n15) Bending must go only sideways. Ensure the torso doesn’t move in forward or backward Avoid applying force while bending as that may strain the muscles.\n16) If you suffer from any of this condition, avoid practicing Swaying Palm Tree Pose: cardiac problem, hernia, back pain, slipped disc, vertigo, spinal injuries, knee problems, frequent headaches or high blood pressure.",
         "pose_release":[],
         "pose_benefits":"\n1) Prevents osteoporosis in aged people.\n2) Helpful in getting rid of constipation and gastritis.\n3) A perfect asana for the beginners to develop a strong core.\n4) Stretches the muscles of the back and joints of the spinal column.\n5) Balances left and right postural muscles thus improving the posture.\n6) Loosens, tones up and massages the sides of the waists, therefore, removing excess fat.\n7) A useful posture for pregnant women as practicing it relieves a backache and muscular pain.\n8) Stimulates the functioning of liver, kidney, spleen and digestive system. \n9) Removes constipation.\n10) Beneficial for people suffering from bronchitis, bronchiectasis, asthma and chronic obstructive pulmonary disease (COPD). ",
         "pose_precautions":"\n1) People suffering from hernia should not practice.\n2) If you are suffering from back pain, then don’t practice it.\n3) This practice is prohibited for those who are suffering from hypertension and any cardiac problem\n4) If you have cervical pain, it advised to leave the practice.\n5) People suffering from severe headache should not practice this asana.",
         "pose_links":"https://rb.gy/omnqbf"
      },
      {
         "id":"41",
         "pose_name":"Trikonasana",
         "other_names":"Triangle Posture, Trikon Asan, Trikona Asan, Side Bend Pose",
         "pose_description":"Trikonasana, the Triangle Pose, concludes the yoga postures in our Basic Session. It augments the movement of the Half Spinal Twist Yoga Pose and gives an excellent lateral stretch to the spine, toning the spinal nerves and helping the proper functioning of the digestive system.",
         "pose_steps":"\n1) Stand erect. Now, keep distance between your legs about 3 to 4 feet\n2) Extend your arms at the shoulder level.\n3) Inhale and raises your right arm by the side of your head.\n4) Now, bend your right arms with exhaling towards the left side by keeping your bodyweight equally on both the feet. \n5) You should ensure that the right arm becomes parallel to the ground.\n6) Maintain the position as per your comfort with normal breathing and come to the original position by inhaling.\n7) Do the same procedure with the left arm.\n8) Perform three to five rounds of trikonasana.",
         "pose_release":[],
         "pose_benefits":"\n1) This asana is good to burn fat. Therefore, it is recommended to a person who is facing the conditions of weight and obesity.\n2) It is good for your backache\n3) This Yoga pose is recommended for growing children to increase their height.\n4) Triangle pose helps to strengthen your legs, knees, and ankles.\n5) Good for your digestion\n6) It may be used for stress management.\n7) Triangle pose helps to expand your chest and shoulders.\n8) It ensures the mobility of hip joints and neck and gives proper stretch to your spine.\n9) It strengthens the muscles in the thighs, hips, and back. \n10) It provides stamina, balance, energy and develops focus.",
         "pose_precautions":"\n1) This asana shouldn’t be performed who has severe back pain.\n2) Avoid this yoga who is suffering from migraines.\n3) A person is detected with diarrhea, high blood pressure, neck & back injuries, shouldn’t perform this asana.\n4) Those who are experiencing dizziness shouldn’t look down at the floor during the final stage.\n5) Cervical spondylosis should do it with proper precautions.\n6) Don’t take the support of your knee while performing this asana as it exerts excess pressure on your knee that may lead to knee problems.\n7) Having neck problems, don’t look up while performing this asana. It is better to gaze straight or look down at the floor.",
         "pose_links":"https://rb.gy/8jsi0d"
      },
      {
         "id":"42",
         "pose_name":"Adho-Mukha-Svanasana",
         "other_names":"Downward-Facing Dog Posture, headstand pose, downward facing tree, Adho Mukh Sav Asan, Savasana, Shavasana",
         "pose_description":"This asana is one of the most widely recognized yoga poses, Downward-Facing Dog is an all-over, rejuvenating stretch. Downward-facing dog is an ancient posture depicted in Egyptian Art that is thousands of years old. It teaches us that how everything is connected; how our heels are linked to our shoulders, how fingers influence heart, how our elbow placement effects the spine.",
         "pose_steps":"\n1) Stand on four limbs, such that your body forms a table-like structure.\n2) Exhale and gently lift your hips and straighten your elbows and knees. You need to ensure your body forms an inverted ‘V’.\n3) Your hands should be in line with your shoulders, and your feet in line with your hips. Make sure that your toes point outwards.\n4) Now, press your hands into the ground and lengthen your neck. Your ears should touch your inner arms, and you should turn your gaze to your navel.\n5) Hold for a few seconds, and then, bend your knees and return to the table position.",
         "pose_release":[],
         "pose_benefits":"\n1) Strengthens The Abdominal MusclesThe inversion of the downward facing dog pose is the boat pose. We all know that the Navasana benefits the abdominal muscles that also help support the spine. This exercise has similar effects on the abdominal muscles. It helps to stretch and strengthen these muscles.\n2) Improves CirculationIt might not have come to your notice, but the downward facing dog is actually an inversion. The hips are lifted, and the head is dropped below the heart. There is a reversal in the pull of gravity, so fresh blood flows, thus promoting circulation.\n3) Improves DigestionThis asana is not a full fold, but it still allows the abdominal muscles to compress the organs of the digestive system, including the liver, kidneys, and the spleen.\n4) Tones The Hands And FeetThe body weight is on your hands and feet when you do the Adho Mukha Svanasana. Therefore, it tones the limbs and prepares them for better balance.\n5) Decreases AnxietyThis pose also helps you relax and calms your mind, thus reducing anxiety. As the neck and cervical spine are stretched, stress is released.",
         "pose_precautions":"Avoid practicing this asana if you suffer from\n1) Carpal tunnel syndrome\n2) High blood pressure\n3) A detached retina\n4) A dislocated shoulder\n5) Weak eye capillaries\n6) Diarrhoea.\n7) Pregnant women should practice this asana with caution. \n8) It is best to consult your doctor before you indulge in the practice.",
         "pose_links":"https://rb.gy/vxwpxl"
      },
      {
         "id":"43",
         "pose_name":"Balasana-1",
         "other_names":"Child Posture, Baby Pose, Foetus Pose, Bal Asan, Bala Asana, Garbhasana, Gharbha Asana, Gharabh Asan",
         "pose_description":"Balasana is a resting pose that can precede or follow any asana. It looks like a foetus that’s why it is also called Foetus pose or Garbhasana.",
         "pose_steps":"\n1)  Sit on your heels on a yoga mat or on the floor.\n2) Either keep your knees together or apart.\n3) Slowly, bend forward by lowering your forehead to touch the floor, exhaling as you do so.\n4) Keep your arms alongside your body. Make sure that your palms are facing up.\n5) Alternatively, you can reach out your arms towards the front of the yoga mat, palms placed facing down on the mat.\n6) Now that you are in this pose, gently press your chest on the thighs (or between the thighs if the latter are apart). balasana\n7) Hold for 45 seconds to 1 minute. Regulate your breath.\n8) As you inhale, imagine your breath is being driven through your navel, and pull your navel towards your spine.Listen to the latest songs, only on JioSaavn.com\n9) As you exhale, soften your body and the arms. Repeat for 4-12 breaths.\n10) Place your palms under the shoulders and gradually raise your upper body to return to the sitting position on the heels while inhaling. Do this very slowly as if uncurling the spine.COMMENTS11) Relax.",
         "pose_release":[],
         "pose_benefits":"\n1) Helps relieve fatigue. As this is a resting pose, it helps relax the body. The regulated breathing helps restore you to a state of calmness.\n2) For the reasons mentioned above, this is also a great pose to ease anxiety and stress. Being curled up, makes one aware of the breathing pattern. Focussing on the breathing helps relax the mind.\n3) The pose helps lengthen and stretch out the spine.\n4) It also gently stretches the ankles, hips and shoulders.\n5) Stimulates digestion and elimination.\n6) By stretching the spine, it also helps ease neck and back pain.",
         "pose_precautions":"This pose should not be performed if you fall in any of the below categories:\n1) Pregnant women\n2) Suffering from diarrhoea\n3) Knee injury",
         "pose_links":"https://rb.gy/ueawez"
      },
      {
         "id":"44",
         "pose_name":"Bhastrika",
         "other_names":"Bellows",
         "pose_description":"Bhastrika is primarily consists of forced rapid deep breathing which serves as a basis for many varieties of exercises, all of which may be described by the same name. Although air is forced both in and out, the emphasis is placed upon the expulsion or explosion of air.",
         "pose_steps":"\n1) Sit in Padmasana (Lotus Pose).\n2)Take a deep breath and fill your lungs with air.\n3) Release the breath after counting till five.\n4) Listen to the latest songs, only on JioSaavn.com\n5) Now begin practicing the technique by inhaling and exhaling with force and mimicking the panting activity.\n6) To begin with, practice at least 21 times (one round of inhalation and exhalation will count as one time).You can take breaks and continue doing it for three minutes. \n7)  Gradually increase the count and the duration as the stamina increases.",
         "pose_release":[],
         "pose_benefits":"\n1) It is good for brain oxygenation.\n2) It benefits the nervous and the motor system.\n3) It is great for energizing the body and the mind\n4) Good for people with depression and anxiety\n5) It helps in treating fibrosis\n6) Great for lungs and people who suffer from repetitive cough, flu, respiratory issues, allergies or breathlessness\n7) Helps strengthen immunity\n8) Checks sleep apnea as well.",
         "pose_precautions":"\n1) People with hypertension and heart issues must not attempt practicing Bhastrika. \n2) Pregnant women should also steer clear of it. \n3) Don't practice Bhastrika while you're undergoing a migraine attack",
         "pose_links":"https://rb.gy/elwpfg"
      },
      {
         "id":"45",
         "pose_name":"Ujjai",
         "other_names":"Ujjayi, Ujjayee, Victorious Breath, Ocean Breath, Loud Breathing",
         "pose_description":"In Ujjai breathing, the glottis is partially closed. The glottis is that part in the throat area that closes when you swallow, but which is open when you breath. When you partially close the glottis while breathing, you can hear a sound resonate from within, as well as feel a flow of air on the palate. A slightly different sound is heard on inhalation and exhalation.",
         "pose_steps":"\n1) Close the mouth and constrict the throat (the glottis — a part of larynx).\n2) Make a short exhalation and then start inhaling—slowly and rhythmically in one long and unbroken inspiration.\n3) Allow the air to pass through the constricted throat, creating a “friction sound”.\n4) Continue inhaling till a sense of fullness is felt in the chest.\n5) Retain the inhaled air for a period of 6 seconds (preferably double the period of inspiration).\n6) Ensure: While sitting spine, head and neck is maintained erect.\n7) Facial muscles are relaxed and nose is not constricted. Inhalation is slow and rhythmic – long, unbroken and without jerks.\n8) Now exhale as naturally as possible – gradually, avoiding jerky or hasty movements.\n9) Take few normal breaths and relax.",
         "pose_release":[],
         "pose_benefits":"\n1) Helps rectify fluid retention in the body (edema/ dropsy).\n2) Clears phlegm & increases appetite.\n3) Beneficial in chronic cold, cough, indigestion, liver problems, dysentery, fever and other diseases.\n4) Ghatashudhhi or purification of seven dhatus (elements) Skin, flesh, blood, bones, marrow, fat and semen.\n5) There is enrichment of the voice.\n6) Stimulates and balances the thyroid.",
         "pose_precautions":"\n1) Not recommended in serious cardiac and hypertension cases. \n2) Can practice without retention of breath.",
         "pose_links":"https://rb.gy/ao4xcl"
      },
      {
         "id":"46",
         "pose_name":"Vrikshasana ",
         "other_names":"Tree Pose",
         "pose_description":"This pose gives you a sense of grounding. It improves your balance and strengthens your legs and back. It replicates the steady stance of a tree.",
         "pose_steps":"\n1) Place your right foot high up on your left thigh. The sole of the foot should be flat and placed firmly. \n2)  Keep your left leg straight and find your balance. \n3) While inhaling, raise your arms over your head and bring your palms together. \n4) Ensure that your spine is straight and take a few deep breaths. \n5) Slowly exhale, bring your hands down and release your right leg. \n6) Back in the standing position repeat the same with the other leg.",
         "pose_release":[],
         "pose_benefits":"\n1) It stretches the entire body from toes to fingers, thus invigorates you.\n2) It gives tranquillity to your mind thus good for those who are facing the problem of depression and anxiety.\n3) It increases your stamina, concentration and immunity.\n4)It is good for your hips as it helps to open it.\n5) It is beneficial for those who are experiencing sciatica. But one should practice it under the supervision of a yoga expert.\n6) It enhances the flexibility of legs, back and chest muscles.\n7) It makes your ankle stronger.\n8) It should be performed as knees yoga.  The person who is having knee problems should perform it.\n9) It strengthens thighs and calves.\n10) It gives suitable stretching to the groins.\n11) Person suffering from flat feet should practice it.\n12) It makes you more focused and concentrated.\n13) By practicing this asana, the ligaments and tendons of the feet gets strengthen.\n14) It is also good for pelvic region.\n15) It develops esteem and self-confidence.\n16) It calms and relaxes the central nervous system.\n17) It helps to cure rheumatic pain and also treats numbness.",
         "pose_precautions":"It should not be practiced in case of\n1) High blood pressure\n2) Low blood pressure\n3) Migraine\n4) Insomnia\n5) Acute knee problems\n6) Hip injury",
         "pose_links":"https://rb.gy/uifwsn"
      },
      {
         "id":"47",
         "pose_name":"Kursiasana",
         "other_names":"Chair pose",
         "pose_description":"An intensely powerful pose, this one strengthens the muscles of the legs and arms. It builds your willpower and has an energizing effect on the body and mind. Stand straight with your feet slightly apart.",
         "pose_steps":"\n1) Stretch your arms but don't bend your elbow. Inhale and bend your knees, pushing your pelvis down like you are sitting on chair. \n2) Keep your hands parallel to the ground and back straight. \n3) Take deep breaths. \n4) Bend gradually but make sure your knees don't go beyond your toes",
         "pose_release":"\n1) While inhalation straightens knees.\n2) Exhale and release arms beside the body and come to a normal position.",
         "pose_benefits":"\n1) Strengthens and stabilize the ankles, thighs, calves, spine, abdominal and lower back muscles.\n2) Stimulates the abdominal organs, diaphragm, and heart.\n3) Improve function of respiratory, digestive and circulatory systems\n4) Opens and stretches the chest and shoulders.\n5) Improves confidence, sense of balance and focus.\n6)Therapeutic for flat feet.",
         "pose_precautions":"Avoided during : \n1) Headache\n2) Insomnia\n3) High or Low blood pressure\n4) Shoulder, Spine, thigh or hip problems",
         "pose_links":"https://rb.gy/55m11c"
      },
      {
         "id":"48",
         "pose_name":"Naukasana",
         "other_names":"Boat pose",
         "pose_description":"It tightens the abdominal muscles and strengthens shoulders and upper back. It leaves the practitioner with a sense of stability.",
         "pose_steps":"\n1) Lie back on the mat with your feet together and hands by your side. \n2) Take a deep breath and while exhaling gently lift your chest and feet off the ground. \n3) Stretch your hands in the direction of your feet. \n4)  Your eyes, fingers and toes should be in one line. \n5) Hold till you feel some tension in your navel area as your abdominal muscles begin to contract. \n6) As you exhale, come back to the ground and relax.",
         "pose_release":[],
         "pose_benefits":"\n1) Naukasana strengthens the abdominal muscles.\n2) It strengthens the muscles of the arms, thighs and shoulders.\n3) It improves the health of all organs in the abdomen especially the liver, pancreas and kidneys.\n4) It helps in regulating blood flow at sugar level.\n5) It toughens muscles of neck, shoulder and the legs.\n6) The stretching, compressing and relaxation of the abdominal region involved with Naukasana is a really good and effective way of burning belly fat if practiced on a regular basis.\n7) The stimulation while performing the pose helps improve and regulate your digestion, including alleviating excessive gas and easing constipation.\n8)Most importantly it acts as a distress tool, keeping your mind free and peaceful.",
         "pose_precautions":"\n1) Avoid straining the body beyond the limits as it may cause back pain or injury.\n2) Avoid practicing this asana during periods or at least during the first two days of every month’s menstrual cycle.\n3) People suffering from any of this condition should avoid practicing this asana: High or low blood pressure, ulcer, joint pain, migraine, insomnia, heart disease, asthma or spinal disorders.",
         "pose_links":"https://rb.gy/xwaann"
      },
      {
         "id":"49",
         "pose_name":"Sukhasana",
         "pose_description":"Sukhasna is a comfortable position for pranayama and meditation. It gives the practitioner a centering effect. All the other asnas are done to eventually make the body feel comfortable to be able to sit in this position for meditation. This asna takes the yoga practice beyond its physical dimension and helps you get in touch with your spiritual side.",
         "pose_steps":"\n1) Sit comfortably on the mat with crossed legs (left leg tugged inside the right thigh and right leg tugged inside the left thigh). \n2) Keep spine straight. \n3) Place your hands on your knees. \n4) You can use the Jnana mudra or Chin mudra. \n5) Relax your body and breathe gently.",
         "pose_release":[],
         "pose_benefits":"\n1) Gradually strengthens muscles of the back and improves body posture.\n2 Being a meditative pose it has relaxing effects on mind and body.\n3) Works as a preparatory pose for more difficult meditative poses.\n4) Builds physical and mental balance.\n5) Helpful in reducing stress and anxiety.\n6) Excellent for people having a stiff body.\n7) Creates flexibility in ankle, knee and hip joints.\n8)Improves concentration for achieving an effective meditation practice.",
         "pose_precautions":"\n1) Avoid practicing Easy Pose in case of severe knee pain, lower backache or sciatica.",
         "pose_links":"https://rb.gy/gx3wdp"
      },
      {
         "id":"50",
         "pose_name":"Uttana shishisana",
         "other_names":"Down Dog on a chair",
         "pose_description":"Downward-Facing Dog is the bread and butter of yoga, but it can be challenging for beginners.This modification shares the same benefits as the classic pose — stretching the hamstrings, opening the shoulders, and creating length in the spine — without all the weight on your upper body.",
         "pose_steps":"\n1) Place your hands on the back of a chair with palms shoulder-distance apart. \n2) Step your feet back until they align under hips, creating a right angle with your body, spine parallel with the floor.",
         "pose_release":[],
         "pose_benefits":"It stretches your shoulders and spine.It fortifies the body.It makes your spine flexible.It reduces the symptoms of chronic stress, insomnia and tension.Stretches and strengthens your hips, upper back and armsIt calms the mind and helps to relieve in stress.",
         "pose_precautions":"\n1) In case of knee injuries or leg injuries don’t perform this Pose. \n2) First of all master in basic Asana then go for next level. \n3) Benefits are relying on the daily basis of your practice. \n4) Keep smiling while you perform Asana, stretch or bend as much as you can. \n5) If you feel uncomfortable in any asana during holding then release the pose. \n6) Always consult an expert person and doctor also before starting any Asana and Pranayama.",
         "pose_links":"https://rb.gy/8bdumc"
      },
      {
         "id":"51",
         "pose_name":"Baddha konasana",
         "other_names":"Bound Ankle Pose",
         "pose_description":"You’ll give your inner thighs and groin a nice stretch, while the forward bend creates a calming, cooling effect.",
         "pose_steps":"\n1) Sitting on the floor, bend knees and open them out to the side like a book. \n2) Join the soles of your feet together while sitting upright. \n3) Place fingertips on the floor directly behind you and lengthen up through the spine. \n4) You can also hold onto your ankles and hinge forward at the hips.",
         "pose_release":[],
         "pose_benefits":"\n1) It stretches groin and inner thighs.\n2) Increases the flexibility of knees, ankles, feet and hips.\n3) Opens pelvic region.\n4) Best prenatal exercise and relieves in menstrual issues.\n5) Especially beneficial in urinary disorders.\n6) Cut down the tension from the groin part and gap up the hips and inner thighs.\n7) Beneficial for the lumbar region.\n8) Useful in flat feet, high blood pressure.\n9) Very beneficial in infertility and asthma.",
         "pose_precautions":"\n1) Avoid this Asana if you’ve got injury within the hips, groin or knee region. \n2) You’ll use the wall for supporting the back if you are suffering from back problems.",
         "pose_links":"https://rb.gy/ipf1ep"
      },
      {
         "id":"52",
         "pose_name":"Kumbhakasana",
         "other_names":"Plank Pose",
         "pose_description":"Considered one of the best moves for core strength, Plank Pose strengthens your abdominals and promotes stability.",
         "pose_steps":"\n1) Start in Downward-Facing Dog. \n2) Shift forward so your shoulders are stacked over your wrists. \n3) Draw your navel in toward your spine and keep your hips from dropping. \n4) Reach heels back as you lengthen the crown of your head forward. \n5) Ground down into hands, pushing the floor away beneath you. \n6) Lengthen through the arms and broaden your chest.",
         "pose_release":[],
         "pose_benefits":"\n1) Offers similar health benefits as aerobic exercise\n2) Improves cardio-respiratory fitness\n3) Raises endurance levels\n4) Prepares the body for more challenging arm balance poses, such as side plank\n5) Tones your thigh and calves\n6) Improves your posture\n7) Strengthens your wrists\n8) Works several parts of your body, including your core, chest, low back, forearms, and shoulders",
         "pose_precautions":"\n1) Do modify the pose for your comfort and skill level. \n2) You can try dolphin plank pose (forearms to the ground instead of your hands) or half plank pose (knees on the ground) instead.\n3) Do learn Sun Salutation to better understand how plank pose is incorporated into this popular sequence.\n4) Do open the space between your shoulder blades to deepen this posture.\n5) Don’t practice the full extension of this pose if you have carpal tunnel syndrome as it places too much stress on your hands and wrists. Instead, modify the posture by resting your forearms on the floor instead of holding yourself up with your hands.\n6) Don’t practice plank if you have osteoporosis as it could increase your risk of fractures.\n7) Don’t allow your chest to collapse to the floor—proper posture is key to strengthening your core and back muscles.",
         "pose_links":"https://rb.gy/jy0bds"
      },
      {
         "id":"53",
         "pose_name":"Urdhva mukha svanasana",
         "other_names":"Upward-Facing Dog",
         "pose_description":"You’ll open up your chest and shoulders, while stretching the abdominals and hip flexors. This pose comes after chaturanga in a classic sun salutation.",
         "pose_steps":"\n1) Lie facedown on the floor. \n2) Bend elbows and place hands on the mat in line with lower ribs. \n3) Hug your elbows in line with your torso. \n3) Tuck your toes and take an inhale. \n4) As you exhale, push the floor away like a push-up. \n5) Straighten your arms and broaden across the chest, hovering your hips a few inches above the floor at the same time.",
         "pose_release":[],
         "pose_benefits":"\n1) The best exercise for your wrists.\n2) Beneficial for lower back coz this pose stretches the lower back muscles.\n3) Stretches the muscles of the shoulders and chest also.\n4) It tones and stimulates the abdominal muscles and organs\n5) It improves the posture of the body.\n6) Beneficial for the chest, heart and lungs.\n7) It stretches the upper back and front of your body\n8) Gives strength to your shoulders, wrists, arms, and backbone.\n9) Helpful in mild depression, fatigue and sciatica.\n10) Very therapeutic in asthma problems. Because it stretches and gives strength to the lungs and chest.\n11) Neutralize the problems related to bad posture.",
         "pose_precautions":"\n1) Those who are suffering or nursing a back injury don’t perform this asana and in case of carpal tunnel syndrome avoid it. \n2) If you are pregnant or having problems like migraine or headache please avoid this pose. \n3) Please concern a yoga specialist and Doctor before doing any yogic activities.",
         "pose_links":"https://rb.gy/esjl13"
      },
      {
         "id":"54",
         "pose_name":"Ardha chandrasana",
         "other_names":"Half moon pose",
         "pose_description":"This balancing pose strengthens your legs and outer hips. It also stretches your hamstrings and inner thighs, and promotes concentration.",
         "pose_steps":"\n1) Start in a Triangle Pose. \n2) Bend your front knee, keep it in line with your second toe. \n3) Step back foot in and walk front hand about 12 inches forward. \n4) Keep it on the floor or place it onto a block. \n5) Shift your weight onto your front foot and lift your back foot off the ground. \n6) Straighten out the front leg, keeping your front hand on the floor or on a block.Reach your back leg toward the wall behind you, foot flexed. \n7) Lift your back arm up toward the sky. \n8) Keep your gaze on the hand touching the ground.",
         "pose_release":[],
         "pose_benefits":"\n1) This yoga posture helps in improving balance of the body and increases awareness. The person becomes aware of their body.\n2) It strengthens the hamstrings, thighs and the ankles.\n3) Keeps the thighbones strong while helping to get rid of back pain.\n4) This asana strengthens buttocks, spine and the abdominal muscles.\n5) The process of digestion gets improved to a great extent with the help of this asana.\n6) Balance and coordination get improved to a great extent with the regular practice of this asana.",
         "pose_precautions":"\n1) People who have neck problems should not keep looking straight and they should remember to keep their neck long.\n2) If someone have any problems like insomnia, low blood pressure, migraine, cervical then it not advisable for them to practice this asana.ardha-chandrasanaTip:\n1) It is best to practice this yoga asana on an empty stomach. \n2) You should see to it that you eat at-least four to six hours earlier than you actually practice this asana. \n3) When the food is digested in the right manner then the energy of the human body gets expanded.",
         "pose_links":"https://rb.gy/bbcndi"
      },
      {
         "id":"55",
         "pose_name":"Ardha pincha mayurasana",
         "other_names":"Dolphin pose",
         "pose_description":"This pose helps build strength in your upper body in preparation for a headstand and forearm stand. It can also help calm your mind and relieve stress.",
         "pose_steps":"\n1) From all fours, come down onto your forearms. \n2) Spread your fingers wide and keep elbows shoulder-width apart. \n3) On an inhale, tuck your toes and lift your hips up and back like you’re in Downward-Facing Dog. \n4) Allow your head to hang above the floor.\n5) Ground down into your forearms and lift your upper body away from the floor. \n6) Press your heels down toward the mat for a nice hamstring stretch.",
         "pose_release":[],
         "pose_benefits":"\n1) This posture is a boost for the upper body, include strengthening the Back, \n2) Abdomen, Legs, Neck, Chest, mid- and lower back, hips and hamstrings.\n3) Ardha Pincha Mayurasana is one such yoga asana which has been found to stimulate the nervous system.\n4) It can help increase attention and concentration by increasing blood flow to the brain.\n5) This pose also helps relieve compression between the vertebrae in the spine, which can be caused by sitting for long periods of time.\n6) Any yoga pose that brings extra blood flow to that stimulate the pineal gland. \n7) That helps you sleep better as well as relieving cramps, headaches and for easing anxiety.\n8) Regular practicing of dolphin pose can improve digestion by stimulating digestive organs.",
         "pose_precautions":"\n1) According to the experts, this asana is considered best when yogi practiced early in the morning. \n2) Mornings are preferred as the food is digested as well as the body has the energy to perform the asana. \n3) Due to some reason, you cannot practice it in the morning, you can practice this asana in the evening as well. \n4) But at least keep 3-5 hour gap between your practice and meal.\n5) Dolphin pose must avoid deep squats with any knee injury.\n6) Do not practice in case of a herniated disk or an injury in the lower back.\n7) Avoid this Asana, in case of back, neck, ankles your arms injury.",
         "pose_links":"https://rb.gy/oalbl5"
      },
      {
         "id":"56",
         "pose_name":"Vasisthasana",
         "other_names":"Side plank",
         "pose_description":"This pose strengthens your shoulders, upper back, and abdominals. It also promotes core and scapular stability, which is helpful if you’re working on inversions or arm balances.",
         "pose_steps":" \n1) Start in Downward-Facing Dog. \n2) Turn onto the outer edge of your right foot, making sure that your right foot and right hand are in alignment.\n3) Stack your left foot on top of your right. \n4) Lengthen through the spine through the crown of your head. \n6) Once you’re stable, lift your left hand up toward the sky.\n7) Press the floor away from you with the bottom hand.",
         "pose_release":[],
         "pose_benefits":"\n1) The practice of Vasisthasana (Side Plank Pose) is Builds arm, wrist and shoulder strength\n2) Its describe as a total body pose where every muscle needs to work.\n3) It also build strengthen the core muscles in the abdomen, inner thighs, and hamstrings.\n4) Vasisthasana (Side Plank Pose) is mainly done to improve the pressure on the wrists and feet.\n5) Vasisthasana helps boost energy in the body.\n6) It provide a good sense of balance.\n7) It not only stretches the body but also makes strong too.\n8) It also improve focus and concentration",
         "pose_precautions":"Tips\n1) You can keep the left knee on the floor. This will give you the support.\n2) In this yoga posture your feet might slip, You may fall. for it you can use the yoga bricks under the right foot.Precautions\n1) People has glaucoma suspect should avoid this posture.\n2) If you suffering from Carpal tunnel syndrome must be avoided practicing this asana.\n3) High blood pressure patient cannot practices this asana.\n4) If you have any kind of elbow, wrist, or shoulder injury, you must avoid this pose.",
         "pose_links":"https://rb.gy/8hsiyx"
      },
      {
         "id":"57",
         "pose_name":"Parivrtta trikonasana",
         "other_names":"Revolved Triangle Pose",
         "pose_description":"This balancing posture stretches your hamstrings and outer hips. Twisting promotes the overall health of the spine and engages your abdominal obliques to facilitate the twist.",
         "pose_steps":"\n1) From mountain pose, step your left foot back and place it flat on the floor, turned out 45 degrees. \n2) Line your feet up heel to heel, or wider for more stability and space.\n3) Ground down into both feet and lift up through your thighs. \n4) Hinge forward at the hips and lengthen spine over your front thigh. \n5) Release your left hand to a block placed on the outer edge of your front foot. \n6) You can also place the block on the inside of the front foot. \n7) Rotate your torso to the right. \n8) Stretch your right arm up.",
         "pose_release":[],
         "pose_benefits":"\n1) Tones stretches and strengthens the muscles of hamstring, thigh and\n2) Massages reproductive organs and pelvic region of the body.\n3) Gives an intense stretch to the spine and enhances its flexibility. Strengthens spinal nerves.\n4) Removes the stiffness of neck and Beneficial in correcting the misalignment of the shoulders.\n5) Directs the blood flow in the lower region of the spine improving its functioning.\n6) Revitalize abdominal organs hence helpful in getting rid of digestive problems and constipation.\n7) Helpful in getting rid of anxiety as it stimulates the whole functioning of the nervous system.",
         "pose_precautions":"\n1) If you are new to this pose, keep the head in the neutral position instead of upward.\n2) Avoid practicing this asana in case of severe pain in the neck, back or shoulders.\n3) Avoid practicing Revolved Triangle Pose if you have or had a recent back or spine injury.\n4) If you suffer from any of this condition abstain from practicing this pose: migraine, knee problems, vertigo, heart problem, cervical spondylitis, low blood pressure, breathing troubles, any kind of sleeping disorder, frequent headaches or insomnia.",
         "pose_links":"https://rb.gy/n67m6v"
      },
      {
         "id":"58",
         "pose_name":"Bakasana",
         "other_names":"Crow pose",
         "pose_description":"Crow Pose builds (and requires) serious strength in your arms, wrists, core, and hip flexors.",
         "pose_steps":"\n1) Start in Mountain Pose. \n2) Come down to a deep squat, with your feet a few inches apart and your heels lifted off the mat. \n3) Make your knees wider than your hips. \n4) Bring your palms down in front of you between your knees, shoulder-width apart. \n5) Hook your shins around your upper arms.\n6) Look forward, shift your weight forward onto your hands, and lift your feet off the floor. \n7) Pull up through your arms and abs, and round your upper back. \\8) If you can, bring your toes to touch beneath your tailbone.",
         "pose_release":[],
         "pose_benefits":"\n1) Strengthens wrists, arms, abdomen and shoulders.\n2)Originates a sense of physical balance and coordination.\n3) Balances nervous system and strengthens the core.",
         "pose_precautions":"\n1) Don’t raise the buttocks too high as that put excessive stress on the arms. \n2) Don’t try to jump your feet off the floor. \n3) First, you need to transfer all your weight on your arms followed by lifting your feet off the ground.\n4) People who suffer from any of this condition must avoid practicing Bakasana: recent wrist or shoulder injury, heart problems, carpal tunnel syndrome or cerebral thrombosis.",
         "pose_links":"https://rb.gy/xhy2sq"
      },
      {
         "id":"59",
         "pose_name":"Urdhva Dhanurasna",
         "other_names":"Wheel Pose",
         "pose_description":"This backbend opens the entire front of the body. It strengthens the muscles in your back, shoulders, and hamstrings.",
         "pose_steps":"\n1) Lie faceup with knees bent, feet flat on the floor, like you’re prepping for bridge pose. \n2) Position your feet parallel to one another, hip-distance apart, with heels under the knees.",
         "pose_release":[],
         "pose_benefits":"\n1) Stretches the chest and lungs\n2) Strengthens the arms and wrists, legs, buttocks, abdomen, and spine\n3) Stimulates the thyroid and pituitary\n4) Increases energy and counteracts depression\n5) Therapeutic for asthma, back pain, infertility, and osteoporosis",
         "pose_precautions":"\n1) You should not do Wheel Pose if you have had an injury or chronic problem with your knees, wrists, shoulders, neck, or back. \n2) Don't force your body into the pose before it is flexible enough to do so without straining. \n3) Bend back only as far as you can naturally. \n4) With continued practice, you will gradually build your flexibility to achieve the pose.",
         "pose_links":"https://rb.gy/jgrelq"
      },
      {
         "id":"60",
         "pose_name":"Adho mukha vrksasana",
         "other_names":"Wall-assisted handstand",
         "pose_description":"This energizing inversion strengthens your shoulders, arms, and wrists. It helps to promote a sense of balance, confidence, and calm.",
         "pose_steps":"\n1) Start in Downward-Facing Dog, facing the wall. \n2)  Place your hands 6 inches from the wall. \n3) Bend one knee and step the foot in toward the wall. \n4) Lift the other leg into the air. \n5) When you’re just getting used to being upside down, you may feel the most comfortable hopping off the bottom foot to kick the lifted leg up toward the wall. \n6) Others rely on core strength to bring both the legs up. \n7) Either way, bring your feet together against the wall. \n8) To come out of the pose, bend your knees and use your core to slowly draw your legs down to the ground. \n9)  After an inversion, take a few moments to readjust before returning to your practice.",
         "pose_release":[],
         "pose_benefits":"\n1) Handstand builds strength in your shoulders, arms, and wrists. The psoas muscle also gets a workout in keeping your spine stabilized.\n2) As an inversion, it sends blood to your head, which can both be energizing and conversely help to calm you. Handstand also helps you improve your sense of balance.\n3) Like all poses that are difficult, it's fun to accomplish something that you doubted your ability to do.",
         "pose_precautions":"\n1) Avoid Handstand and other inversions if you have any conditions for which your doctor recommends not letting your head go below the level of your heart.\n2)  These often include uncontrolled high blood pressure, stroke, detached retina, glaucoma, and recent dental bone transplants. \n3) Also avoid this pose if you have an injury or chronic pain condition of your neck, shoulder, or wrist.\n4) To see if your body can handle Handstand, check to ensure you can hold Downward Facing Dog and Plank Pose for more than 30 seconds without any pain or discomfort.\n5) Until you are proficient with Handstand, practice it against a wall or with a friend or instructor spotting you.",
         "pose_links":"https://rb.gy/qppanp"
      },
      {
         "id":"61",
         "pose_name":"Pincha Mayurasana",
         "other_names":"Wall-assisted forearm stand",
         "pose_description":"This is a deep shoulder opener, making it a great preparatory pose for backbends. As an inversion, it also helps improve circulation.",
         "pose_steps":"\n1) Start on all fours, with your head facing the direction of the wall. \n2) Place your elbows on the floor and come down to your forearms, Bring them parallel to one other, shoulder-width apart. \n3) Tuck your toes, lift knees, and reach hips up and back into Dolphin Pose. \n4) Broaden across the chest and gaze at the floor between your forearms. \n5) Step one foot in a few inches. \n6) Lift the other leg up and straight back. \n7) Bend the knee of your grounded leg. \n8) Hop off that foot and send both feet up to the wall. \n9) Squeeze your inner thighs together and reach heels up toward the ceiling.",
         "pose_release":[],
         "pose_benefits":"\n1) This pose not only strengthens your shoulders, arms, core, and back. but also it stretches your shoulders, neck, chest, and abdomen. \n2) By regular practice of Picha Mayurasana can provide an additional sense of balance and stability.\n3) The brain is calmed and helps relieve anxiety and depression and concentration will improve.\n4) This poses also increase in blood to the brain is also energizing.\n5) The daily practice of the asana helps to open up the third Ajna and therefore increases the flow of prana.\n6) Feathered Peacock Pose makes your wrists and elbows also stronger.",
         "pose_precautions":"\n1) According to the experts, this asana is considered best when yogi practiced early in the morning. \n2) Mornings are preferred as the food is digested as well as the body has the energy to perform the asana. \n3) Due to some reason, you cannot practice it in the morning, you can practice this asana in the evening as well. But at least keep a 3-5 hour gap between your practice and meal.\n4) People who suffer from migraines avoid this pose, due to the potential pressure in the shoulders.\n5) It is best to avoid this asana if you suffering from high blood pressure.\n6) Avoid practicing this asana cervical issues and shoulders, neck or back injury.\n7) Diabetes, hypertension patient must be avoided Picha Mayurasana.",
         "pose_links":"https://rb.gy/bluieg"
      },
      {
         "id":"62",
         "pose_name":"Salamba sarvangasana",
         "other_names":"Shoulder stand",
         "pose_description":"Like headstand, this inversion offers numerous benefits to multiple systems in the body. It’s a cooling and energetic way to end your practice.",
         "pose_steps":"\n1) Neatly stack two blankets with the folded edges aligned with the short edge of your mat. \n2) Lay on the blankets and place the tops of your shoulders 2 inches from the edge of the blankets. \n3) Rest your head on the floor, off the blanket. Place your arms at your sides. \n4) Bend your knees and bring your feet to the floor, heels near butt. \n5) As you inhale, bring your knees in toward your chest. \n6) As you exhale, straighten your legs and send them up toward the sky. \n7) Place your hands on your lower back to support your posture, fingertips pointed down toward your tail bone.",
         "pose_release":[],
         "pose_benefits":"\n1) Some of the most important benefits of Sarvangasana are given below:\n2) Thyroid gland: The shoulderstand yoga pose is good for the healthy functioning of pituitary, pineal, kidney, liver, spleen and testes. Thus, it regulates the functions of all the glands of the body.\n3) Invigorates circulatory system: The asana is good in case of circulatory system, respiratory system and digestive system.\n4) Headache: It enhances the supply of blood to the head region and good for managing headache and migraine.\n5) Hypertension: It has cooling effect to the nerves, thus beneficial for high blood pressure patient.\n6) Insomnia: It is good for insomnia patient as it facilitates blood supply to this region.\n7) Constipation: It seems to be panacea for constipation patient. Person suffering from constipation should practice it regularly.\n8) Intestinal ulcers: It stimulates the intestinal and stomach glands thus good for ulcer in these region.\n9) Hair fall: It enhances supply of blood in the head region and prevents hair fall.\n10) Sexual disorders: The yoga pose is beneficial in case of sexual problems such as frequent abortions, leucorrhoea, syphilis, etc.\n11) Weight Loss: It helps in burning of fat.\n12) Eyesight: It is good for eye vision.\n13) Skin care: It helps to prevent wrinkles, pimples and delay aging.",
         "pose_precautions":"\n1) The asana shouldn’t be performed by those who have high blood pressure.\n2) Avoid this asana during menstruation.Having experiencing spinal problems, skip this asana.\n3) Don’t practice in case of glaucoma, acute thyroid problems, chronic neck conditions, shoulder injuries and retina problems.\n4) It should be avoided by those who have heart problems, middle ear problem, capillary, weak age, spondylosis, and Slip disc.",
         "pose_links":"https://rb.gy/3y8dzc"
      },
      {
         "id":"63",
         "pose_name":"Datta Mudra",
         "other_names":" movement of neck",
         "pose_description":"This helps leg muscles and hip joints.",
         "pose_steps":"\n1)  In the Vajrasana position turn your neck to the left side as much as possible, relax all the muscles, continue normal breathing. \n2) Repeat this for right side.",
         "pose_release":[],
         "pose_benefits":"\n1) The Datta Mudra is very much useful in reducing stress and anxiety.  This is because it relaxes the body muscles, giving proper stretch to neck and back.Stretches the posterior muscles of the trunk and the neck. \n2) Improves muscle tone and venous circulation of the spinal column. \n3) Favourable effects on the viscera due to deep intra-abdominal compression. \n4) Lateral stretch stimulates vital areas of the colon. \n5) Acceleration of the venous flow from the sex organs has a favourable effect. \n6) The compression of the diaphragm and the abdominal walls provide massage to the abdominal contents useful in gastric conditions. \n7) Ascending and descending colon gets good pressure thereby alleviating constipation. \n8) Helps prevent sagging of uterus and postnatal laxities. \n9) Lumbar pain is alleviated. \n10) Overall, improves the health of the abdomen and pelvic organs due to good blood circulation and drainage.",
         "pose_precautions":"\n1) Spinal injury and abnormalities, severe back problem and cervical and lumbar spondylosis.\n2) Hypertension, serious cardiac conditions, high BP, hernia and high myopia.\n3) Acute and resolving disc prolapsed (slip disc), acute pain of neck and back, the stiffness of back and joints, bulging tummy.",
         "pose_links":"https://rb.gy/17gmru"
      },
      {
         "id":"64",
         "pose_name":"Suryanamaskar",
         "other_names":"Sun salutation",
         "pose_description":"Surya Namaskar  is a sequence of 12 powerful yoga poses. Besides being a great cardiovascular workout, Surya Namaskar is also known to have an immensely positive impact on the body and mind.",
         "pose_steps":"\n1) Pranamasana (Prayer pose):- Stand at the edge of your mat, keep your feet together and balance your weight equally on both the feet. Expand your chest and relax your shoulders. As you breathe in, lift both arms up from the sides, and as you exhale, bring your palms together in front of the chest in prayer position. \n2)  Hastauttanasana (Raised arms pose):- Breathing in, lift the arms up and back, keeping the biceps close to the ears. In this pose, the effort is to stretch the whole body up from the heels to the tips of the fingers. \n3) Hastapadasana (Standing forward bend):- Breathing out, bend forward from the waist keeping the spine erect. As you exhale completely, bring the hands down to the floor beside the feet. \n4) Ashwa Sanchalanasana (Equestrian pose):- Breathing in, push your right leg back, as far back as possible. Bring the right knee to the floor and look up. \n5) Dandasana (Stick pose):- As you breathe in, take the left leg back and bring the whole body in a straight line. \n6) Ashtanga Namaskara (Salute with eight parts or points):- Gently bring your knees down to the floor and exhale. Take the hips back slightly, slide forward, rest your chest and chin on the floor. Raise your posterior a little bit. The two hands, two feet, two knees, chest and chin (eight parts of the body) should touch the floor. \n7)  Bhujangasana (Cobra pose):- Slide forward and raise the chest up into the Cobra pose. You may keep your elbows bent in this pose with the shoulders away from the ears. Look up at the ceiling. \n8) Adho Mukha Svanasana (Downward facing dog pose):- Breathing out, lift the hips and the tailbone up to bring the body into an inverted ‘V’ pose. \n9) Ashwa Sanchalanasana (Equestrian pose):- Breathing in, bring the right foot forward in between the two hands. The left knee goes down on the floor. Press the hips down and lookup. \n10) Hastapadasana (Standing forward bend):- Breathing out, bring the left foot forward. Keep the palms on the floor. You may bend the knees, if necessary. \n11) Hastauttanasana (Raised arms pose):- Breathing in, roll the spine up. Raise the hands up and bend backward a little bit, pushing the hips slightly outward. \n12) Tadasana (Mountain Pose):- As you exhale, first straighten the body, then bring the arms down. Relax in this position and observe the sensations in your body.",
         "pose_release":" \n1) Complete the round by repeating the steps. \n2) Only this time, start with taking the left foot behind in step number 4 and bringing the right foot forward in step number 10. \n3) Once done, you would’ve completed one round of Surya Namaskar.",
         "pose_benefits":"\n1) Helps maintain cardiovascular health,Stimulates the nervous system, strengthens the immune system, enhances cognitive functions, improves overall health, strengthens the body and relaxes the mind",
         "pose_precautions":"\n1)  Heart patients should consult a doctor before starting this yoga routine. \n2) People having high blood pressure and hernia issues can avoid this sequence. \n3) Pregnant women should not practice Sun Salutation. \n4) Women must also avoid performing Surya Namaskar while on their periods.",
         "pose_links":"https://rb.gy/opuaf6"
      },
      {
         "id":"65",
         "pose_name":"Utthita Parsvakonasana",
         "other_names":"Extended Side Angle Pose",
         "pose_description":"It is a standing yoga pose that utilizes all of the muscles in the body. Its name comes from four Sanskrit words: \"Utthita\" — meaning \"extended\" \"Parsva\" — meaning \"side\" or \"flank\"",
         "pose_steps":"\n1) Turn to the left and extend your arms sideways to shoulder-height, palms facing down. Step your feet as wide apart as your wrists. \n2) Align your heels. \n3) Turn your right leg and foot outward 90 degrees so your toes point to the top of your mat.",
         "pose_release":"\n1) To release, press firmly through your back foot. \n2) Then, exhale as you slowly come up to a standing position with your arms extended at shoulder-height. \n3) Turn your feet and body so they face the same direction, and then step your feet together.",
         "pose_benefits":"\n1) Parsvakonasana relieves stiffness in the shoulders and back. \n2) It provides a deep stretch to the groins and hamstrings, and it also improves stamina. \n3) This pose strengthens the legs, knees, and ankles, while also stretching and toning the abdominal muscles.",
         "pose_precautions":"\n1) Keep the neck in a neutral position if you are new to this pose else you are likely to experience a lot of stress in neck muscles. \n2) Don't put the weight completely on your legs and arms, rather try to stretch your body, distributing your weight evenly.",
         "pose_links":"https://www.youtube.com/watch?v=giYwBNN52XI"
      },
      {
         "id":"66",
         "pose_name":"Utkatasana",
         "other_names":"Awkard chair pose",
         "pose_description":"Chair Pose, is a standing asana in modern yoga as exercise. It was a low squatting asana in medieval hatha yoga.",
         "pose_steps":"\n1) Stand in Tadasana. Inhale and raise your arms perpendicular to the floor. \n2) Exhale and bend your knees, trying to take the thighs as nearly parallel to the floor as possible. \n3) Firm your shoulder blades against the back. \n4) Stay for 30 seconds to a minute.",
         "pose_release":"\n1) To release, inhale and straighten your legs, lifting your body up through your arms. \n3) Exhale and return to Mountain Pose or continue to the next pose in the sequence.",
         "pose_benefits":"\n1) Strengthens the ankles, thighs, calves, and spine. \n2) Stretches shoulders and chest. \n3) Stimulates the abdominal organs, diaphragm, and heart. \n4) Reduces flat feet.",
         "pose_precautions":"\n1) This pose is not recommended if you have low blood pressure or an injury to your hips, knees, or back. \n2) Traditionally, it is avoided if you have insomnia. \n3) If you have balance problems, do this pose near a wall or chair you can touch to stabilize yourself if needed.",
         "pose_links":"https://www.yogajournal.com/videos/chair-pose"
      },
      {
         "id":"67",
         "pose_name":"Virabhadrasana II",
         "other_names":"Warrior II pose",
         "pose_description":"It is a standing yoga pose that enhances strength, stability, and concentration. It's named after the Hindu mythological warrior, Virabhadra, an incarnation of the god Shiva.",
         "pose_steps":"\n1) Stand in Tadasana (Mountain Pose. \n2)Turn your right foot slightly to the right and your left foot out to the left 90 degrees. \n3) Exhale and bend your left knee over the left ankle, so that the shin is perpendicular to the floor. \n4) Stretch the arms away from the space between the shoulder blades, parallel to the floor. \n5) Stay for 30 seconds to 1 minute. \n6) Inhale to come up. \n7) Reverse the feet and repeat for the same length of time to the left.",
         "pose_release":"\n1) To release, inhale as you press down through your back foot and straighten your front leg. \n2) Lower your arms. \n3) Turn to the left, reversing the position of your feet, and repeat for the same length of time on the opposite side.",
         "pose_benefits":"\n1) Stretches your hips, groins and shoulders. \n2) Opens your chest and lungs. \n3) Builds stamina and concentration. \n4) Energizes tired limbs. \n5) Stimulates your abdominal organs.\n6) Helps relieve backaches. \n7) Develops balance and stability. \n8) Improves circulation and respiration.",
         "pose_precautions":"\n1) Do not practice Warrior II if you have a recent hip, knee, or shoulder injury, or if you are experiencing diarrhea or high blood pressure.",
         "pose_links":"https://www.yogajournal.com/videos/warrior-ii-pose"
      },
      {
         "id":"68",
         "pose_name":"Adho mukha svanasana",
         "other_names":"Downward dog pose",
         "pose_description":"It is an inversion asana in modern yoga as exercise, often practised as part of a flowing sequence of poses, especially Surya Namaskar, the Salute to the Sun.",
         "pose_steps":"\n1) Begin on your hands and knees. \n2) Stretch your elbows and relax your upper back. \n3) Spread your fingers wide and press firmly through your palms and knuckles. \n4) Exhale as you tuck your toes and lift your knees off the floor. \n5) Press the floor away from you as you lift through your pelvis. ",
         "pose_release":"\n1) It's fine if your legs are bent, just enjoy the juicy stretch and the feeling of creating space in the back of the body. \n2) After a few deep breaths, slowly release your knees down to the floor, untuck your toes and gently release your hips back down into Child's pose.",
         "pose_benefits":"\n1) Calms the brain and helps relieve stress and mild depression. \n2) Energizes the body. \n3) Stretches the shoulders, hamstrings, calves, arches, and hands. \n4) Strengthens the arms and legs. \n5) Helps relieve the symptoms of menopause. \n6) Relieves menstrual discomfort when done with head supported. \n7) Helps prevent osteoporosis.",
         "pose_precautions":"\n1) Those with stiff or weak back muscles, tight hamstrings, sciatica or knee problems will want to practice Downward Facing Dog gently, easing in and out of the pose while keeping the knees bent and back straight.",
         "pose_links":"https://www.yogajournal.com/videos/downward-facing-dog-pose"
      },
      {
         "id":"69",
         "pose_name":"Urdhva Mukha Shvanasana",
         "other_names":"Upward Facing dog pose",
         "pose_description":"It is a back-bending asana in modern yoga as exercise. It is commonly part of the widely-performed Surya Namaskar sequence, though the similar Bhujangasana may be used there instead.",
         "pose_steps":"\n1) Start on your belly in a prone position. \n2) Bring your hands underneath your elbows, squeeze your elbows together, and draw your shoulders back. \n3) Press down into the tops of your feet and curl your chest up. \n4) Straighten your arms and lift your thighs up off the ground. ",
         "pose_release":"\n1) Place your hands on the floor alongside your body, next to your lower ribs. \n2) Point your fingers to the top of the mat and hug your elbows in close to your ribcage. \n3) Inhale as you press through your hands firmly into the floor. \n4) Straighten your arms, lifting your torso and your legs a few inches off the floor.",
         "pose_benefits":"\n1) Improves posture. \n2)Strengthens the spine, arms, wrists. \n3) Stretches chest and lungs, shoulders, and abdomen. \n4) Firms the buttocks. \n5) Stimulates abdominal organs. \n6) Helps relieve mild depression, fatigue, and sciatica. \n7) Therapeutic for asthma.",
         "pose_precautions":"\n1) The position requires a distributed balance of weight on your palms and shoulders. \n2) If you have a shoulder injury, back injury or sprained wrists, it's best to stay away from this pose. \n3) Pregnant women shouldn't attempt the position without a directive from a physician.",
         "pose_links":"https://www.youtube.com/watch?v=y9sxkuSgV6M"
      },
      {
         "id":"70",
         "pose_name":"Virabhadrasana I",
         "other_names":"Warrior I pose ",
         "pose_description":"Warrior 1 Pose is a standing yoga pose that helps build focus, power and stability. This foundational pose stretches the front side of the body and is great for building strength in the legs, core and back.",
         "pose_steps":"\n1) Begin standing, then step your right foot forward about four feet. \n2) With your foot parallel and toes pointing to the top of the mat, bend your knee into a lunge. \n3) Squeeze your shoulder blades together and downward, and lift your chin to gaze at your hands overhead. \n4) Hold your pose and then repeat on the left side.",
         "pose_release":"\n1) Press down through the outer edge of your back foot, keeping your back leg straight. \n2) Hold for up to one minute. \n3) To release the pose, press your weight through your back heel and straighten your front leg. Lower your arms.",
         "pose_benefits":"\n1) Strengthens your shoulders, arms, legs, ankles and back. \n2)  Opens yours hips, chest and lungs. \n3) Improves focus, balance and stability. \n4) Encourages good circulation and respiration. \n5) Stretches your arms, legs, shoulders, neck, belly, groins and ankles. \n6) Energizes the entire body.",
         "pose_precautions":"\n1) Avoiding this pose if you suffer from high blood pressure and heart problems. \n2) Students with problems to the shoulders should keep their raised arms either parallel or a little wider than parallel to each other.",
         "pose_links":"https://www.artofliving.org/in-en/yoga/yoga-poses/warrior-pose-virbhadrasana"
      },
      {
         "id":"71",
         "pose_name":"Baddha Hasta Uttanasana",
         "other_names":"The Rag Doll Pose, Dangling pose",
         "pose_description":"Ragdoll pose is a basic standing forward bend yoga posture that stretches the lower back.",
         "pose_steps":"\n1) From a Standing Forward Bend (Uttānāsana), separate your feet hip-width apart and catch opposite elbows. \n2) Take a generous bend in your knees if you'd like, to allow your chest and thighs to connect. \n3) Shift some weight forward into the balls of your feet to send your sit bones up.",
         "pose_release":"\n1) To come out of the pose, bring your hands to your hips, keep the micro-bend in your knees and come up to standing with a flat back—engaging your core to support your lower back.",
         "pose_benefits":"\n1) Stretches the ankles, calves, hamstrings and lower back. \n2) Releases tension in the neck and shoulders. \n3) Can help to alleviate lower back and neck pain. \n4) Relieves stress.",
         "pose_precautions":"\n1) Women who are pregnant should avoid the practice of this pose.",
         "pose_links":"https://yoga15.com/pose/ragdoll/"
      },
      {
         "id":"72",
         "pose_name":"Baddha Konasana",
         "other_names":"The Butterfly Pose",
         "pose_description":"It is a restorative pose. In this position, the hips flex, stretching the adductor muscles along the inside of your thighs. The upper body, including the arms shoulders and back, works to connect the hands to the feet and maintain a long spine.",
         "pose_steps":"\n1) Sit on the floor on a yoga mat or a well carpeted area. \n2) Straighten your spine with legs straightened out. \n3) Bend both knees to form a winged butterfly pose. \n4) Bring your feet towards your pelvis as close as you can and join them, holding with your hands.",
         "pose_release":[],
         "pose_benefits":"\n1) The butterfly pose renders a great stretch for the inner thighs and groin. \n2) It improves blood circulation in the lower body that is stalled due to long sitting hours. \n3) It provides relief from menstrual discomfort and issues due to menopause. \n4) Maintains healthy bowels movement.",
         "pose_precautions":"\n1) People who have knee injury should not practise this asana. \n2) If you have a groin injury you should not practise this asana. \n3) Make sure that your spine is erect while performing this asana.",
         "pose_links":"https://www.youtube.com/watch?v=Bv6IJBehD6U"
      },
      {
         "id":"73",
         "pose_name":"Janu Sirsasana",
         "other_names":" Head-to-Knee Forward Bend pose",
         "pose_description":"It is an excellent stretch to relieve tight hamstrings, the muscles in the back of your thighs. If you tend to dislike doing a seated forward bend with both legs straight, this pose may come as a pleasant surprise.",
         "pose_steps":"\n1) Sit with the legs outstretched in front of you (Staff Pose / Dandasana). \n2) Bend your right knee and place the right foot against the left inner thigh, relaxing the knee down. \n3) As you inhale, flex the left foot, press the top of the thigh down, lengthen the spine and raise your arms either side of your head.",
         "pose_release":[],
         "pose_benefits":"\n1) Calms the brain and helps relieve mild depression. \n2) Stretches the spine, shoulders, hamstrings, and groins. \n3) Stimulates the liver and kidneys. \n4) Improves digestion. \n5) Helps relieve the symptoms of menopause. \n6) Relieves anxiety, fatigue, headache, menstrual discomfort.",
         "pose_precautions":"\n1) Lengthen forward into a comfortable stretch. The lower belly should touch the thighs first, the head last. \n2) Stay in the pose anywhere from 1 to 3 minutes. \n3) Come up with an inhalation and repeat the instructions with the legs reversed for the same length of time.",
         "pose_links":"https://www.youtube.com/watch?v=x28oEqOOERg"
      },
      {
         "id":"74",
         "pose_name":"Savasana",
         "other_names":"Corpse pose",
         "pose_description":"It is an asana in hatha yoga and modern yoga as exercise, often used for relaxation at the end of a session. It is the usual pose for the practice of yoga nidra meditation.",
         "pose_steps":"\n1) Lie on your back with your legs straight and arms relaxed at your sides. \n2) Let your feet fall to a natural position and rest your palms facing up. \n3) Close down your eyes. \n4) Breathe naturally. \n5) Allow your body to feel heavy on the ground. \n6) Begin to release each part of your body, organ and cell, consciously working from the soles of your feet to the crown of your head. \n7) Relax your face, feeling your eyes drop into your sockets and the softening of your jaw. Tune in. \n8) If your mind starts to wander, bring your awareness to the sounds around you and then try to find the most distant sound until you find the sound closest to you. \n9) Then tune into your breath. \n10) Once we acknowledge the sounds from outside, the mind is more able to let go. \n11) To exit the pose, gently bring your awareness back to your body. \n12) Start to wriggle your fingers and toes. \n13) With your eyes closed, draw your knees in and slowly roll over to your left or right side. \n14) Rest there for a moment and with an inhale, find a comfortable seated position. \n15) Take the peace and stillness found in this pose with you for the rest of your day.",
         "pose_release":[],
         "pose_benefits":"\n1) Calms the brain and helps relieve stress and mild depression. \n2) Relaxes the body. \n3) Reduces headache, fatigue, and insomnia. \n4) Helps to lower blood pressure.",
         "pose_precautions":"\n1) Avoid moving your body while performing Savasana as it might disturb the practice and will fuel your distractions. \n3) Make sure to perform it on a hard, flat surface. \n4) Practice this in an environment that offers quiet and relaxing surroundings.",
         "pose_links":"https://www.yogajournal.com/videos/corpse-pose"
      },
      {
         "id":"75",
         "pose_name":"Supta Padangusthasana",
         "other_names":"Reclined Hand to Big Toe Pose",
         "pose_description":" Reclining Hand to Big Toe pose, or Supine Hand to Toe pose is a reclining asana in modern yoga as exercise.",
         "pose_steps":"\n1) Hug the thigh to your belly. \n2) Press the front of the right thigh heavily to the floor, and push actively through the right heel. \n3) Loop a strap around the arch of the left foot and hold the strap in both hands. \n4) Inhale and straighten the knee, pressing the left heel up toward the ceiling.",
         "pose_release":[],
         "pose_benefits":"\n1) Reclining Hand-to-Big-Toe Pose offers a stretch to the hips, thighs, hamstrings, and calves, and strengthens the muscles around the knees. \n2) The pose also improves digestion, and can help to relieve lower back pain.",
         "pose_precautions":"\n1) Don't flatten your lumbar curve or press your lower spine into the mat. \n2) Doing so reduces the stretch in your hamstrings and may cause a flattening of your lumbar spine over time, which is unhealthy for your lower back. \n3) Don't perform the pose with your top leg bent, which minimizes the stretch in your hamstring.",
         "pose_links":"https://www.youtube.com/watch?v=SP5AVRRtpuI"
      },
      {
         "id":"76",
         "pose_name":"Sucirandhrasana",
         "other_names":"Eye of the Needle Pose",
         "pose_description":"It is a supine (lying-down) yoga pose that relieves stiffness in the outer hips and lower back. If you spend a lot of time sitting, those muscles become tight and short due to the lack of use. This pose can feel great at the end of a long day of sitting at work, school, or in a car or airplane.",
         "pose_steps":"\n1) Hug your left knee into your chest. \n2) Cross the left ankle over your body and rest it on the right thigh. \n3) Let the left knee relax away from your torso. \n4) Lift your right foot off the floor and thread your left hand through your legs (this is the eye of the needle) so your hands meet on the back side of your right thigh.",
         "pose_release":[],
         "pose_benefits":"\n1) This pose stretches the muscles around the hips, the lower back, and the hamstrings at the back of the thighs. \n2) Hip flexors often become tight when you sit for long periods, while the hamstrings are often tight on runners and those in sports that do a lot of running.",
         "pose_precautions":"\n1) Avoid this pose if you have any shoulder, neck, knee, back, or hip problem. \n2) After the first trimester, pregnant women should avoid poses where you are flat on your back. \n3) You should not feel any stress on the knee. \n4) You will feel a great stretch along the front of the hip, but it should not be painful.",
         "pose_links":"https://www.youtube.com/watch?v=r8KVtck7SP4"
      },
      {
         "id":"77",
         "pose_name":"Anjaneyasana",
         "other_names":"Crescent Lunge pose",
         "pose_description":"It is a dynamic standing yoga pose that utilizes and integrates the muscles in your entire body. It stretches and strengthens the lower and upper body, while creating stability and balance.",
         "pose_steps":"\n1) Bring your hands onto your right knee and your right knee directly over your right ankle. \n2) Inhale and raise your arms above your head, keeping the arms in line with your ears. \n3) Exhale and deepen forward into the lunge, bending the right knee more if possible. \n4) As you do, your left hip comes closer to the floor.",
         "pose_release":"\n1) Bring your hands onto your right knee and your right knee directly over your right ankle. \n2) Inhale and raise your arms above your head, keeping the arms in line with your ears. \n3) Exhale and deepen forward into the lunge, bending the right knee more if possible. \n4) As you do, your left hip comes closer to the floor.",
         "pose_benefits":"\n1) Crescent Lunge Pose stretches the hip flexors and quadriceps. \n2) This is useful for cyclists and for those who sit much of the day. \n3) It also opens the chest, shoulders, and torso. \n4) You can practice it to build your balance and stability.",
         "pose_precautions":"\n1) Be sure not to deepen the front knee quickly, and listen to your body as you move. \n2) If you notice any discomfort in that knee, be sure to stop and back off to avoid further pain and possible injury. \n3) Keep the back foot straight—do not let it sneak inward.",
         "pose_links":"https://www.youtube.com/watch?v=zaongQlYTto"
      },
      {
         "id":"78",
         "pose_name":"Parsvottanasana",
         "other_names":"Pyramid Pose",
         "pose_description":"It is translated as Intense Side Stretch from Sanskrit. ... The name of this pose comes from parsva meaning side, ut meaning intense , and tan meaning to stretch, and asana meaning posture or seat.",
         "pose_steps":"\n1) Press your weight evenly through the outer edge of your back foot and the big toe of your front foot. \n2) Draw your left hip slightly forward, squaring your hips to the top of the mat. \n3) Draw your shoulder blades firmly into your back, but do not let your low ribs puff forward. \n4) Inhale as you reach your arms out to the sides.",
         "pose_release":"\n1) To release, press firmly through your back heel and slowly lift your torso. \n2) Release your arms and place your hands on your hips. \n3) Change the position of your feet, and repeat on the opposite side.",
         "pose_benefits":"\n1) Calm the brain and flush the sinuses with mild inversion. \n2) Stretch the spine. \n3) Strengthen the legs and spine. \n4) Improve posture. \n5) Aid digestion. \n6) Elongate hamstrings.",
         "pose_precautions":"\n1) Avoid this pose if you have any injury or condition affecting your hamstrings, hips, back, shoulders, or wrists. \n2) Because of the deep bend, you should avoid it if you have high blood pressure, heart disease, glaucoma, or are pregnant (especially in the third trimester).",
         "pose_links":"https://www.youtube.com/watch?v=ldJsEyxA5cI"
      },
      {
         "id":"79",
         "pose_name":"Mālāsana",
         "other_names":"Garland Pose",
         "pose_description":"It is used for a different squatting pose with the feet together and the back rounded with multiple hand placement variations.",
         "pose_steps":"\n1) Squat with your feet as close together as possible. \n2)Separate your thighs slightly wider than your torso. \n3) Press your elbows against your inner knees, bringing your palms to together in Anjali Mudra (Salutation Seal), and resist the knees into the elbows. \n4) To go further, press your inner thighs against the sides of your torso. \n5) Reach your arms forward, then swing them out to the sides and notch your shins into your armpits. \n6) Press your finger tips to the floor, or reach around the outside of your ankles and clasp your back heels. \n7) Hold the position for 30 seconds to 1 minute, then inhale, straighten the knees, and stand into Uttanasana. ",
         "pose_release":[],
         "pose_benefits":"\n1) Opens your hips and groin. \n2) Stretches your ankles, lower hamstrings, back and neck. \n3) Tones your abdominals. \n4) Aids in digestion. \n5) Strengthens your metabolism. \n6) Keeps your pelvic and hip joints healthy. \n7) Ideal for prenatal yoga.",
         "pose_precautions":"\n1) Avoid Garland Pose if you have a knee or low back injury. \n2) Be sure to avoid any jerky motion or coming down into your squat forcefully. \n3) Don't push yourself into a deeper squat than your body is ready to achieve. \n4) If you feel any pain, back out of the pose. \n5) Practice this pose only on an empty stomach. \n6) Do not put the pressure on your heel during practicing it.",
         "pose_links":"https://www.yogajournal.com/poses/garland-pose"
      },
      {
         "id":"80",
         "pose_name":"Dhanurasana",
         "other_names":"The Bow pose",
         "pose_description":"It is a backbending asana in hatha yoga and modern yoga as exercise.",
         "pose_steps":"\n1) First of all lie down in prone position. Exhale, bend your knees and hold the ankles with hands. \n2) While inhaling raise the thighs, head and chest as high as possible. \n3) Try to maintain weight of the body on lower abdomen. Join the ankles. \n4) While exhaling, bring down the head and legs up to knee joint.",
         "pose_release":"\n1) Be sure to release the pose once you've lowered your head, chest, thighs, and feet. \n2) Releasing the pose when these body parts are lifted can cause a painful impact on the floor. \n3) Lower yourself slowly and then release your ankles when you can do so safely.",
         "pose_benefits":"\n1) Stretches the entire front of the body, ankles, thighs and groins, abdomen and chest, and throat, and deep hip flexors (psoas) \n2) Strengthens the back muscles. \n3) Improves posture. \n4) Stimulates the organs of the abdomen and neck.",
         "pose_precautions":"\n1) This pose should be avoided if you are pregnant, have high blood pressure, a neck injury, pain in the lower back, hernia, migraine, heart disease, and/or had recent abdominal surgery.",
         "pose_links":"https://www.artofliving.org/in-en/yoga/yoga-poses/bow-pose-dhanurasana"
      },
      {
         "id":"81",
         "pose_name":"Utkatasana",
         "other_names":"Fierce Pose",
         "pose_description":"It is a standing asana in modern yoga as exercise. It was a low squatting asana in medieval hatha yoga.",
         "pose_steps":"\n1) Bend your knees and bring your thighs as parallel to the floor as possible. \n2) Your knees should come out over your feet and your torso should lean forward over the thighs, more or less forming a right angle with them. \n3) Keep your back long, with a slight curve in it, and keep the inner thighs parallel to each other.",
         "pose_release":"\n1) To release from the pose, straighten the knees with an inhalation while lifting strongly through the arms. \n2) Straighten out completely and allow your arms to remain loosely by your sides. \n3) Exhale out completely and come to stand in Tadasana.",
         "pose_benefits":"\n1) Strengthen your legs (ankles, thighs, calves). \n2) Stretch your shoulders, chest and spine. \n3) Stimulate the abdominal region.",
         "pose_precautions":"\n1) Inhale and Exhale: Begin to inhale and exhale while in the pose. \n2) With every inhalation, loosen the body, and with every exhalation take the tail bone out, pushing the hips down and stretching the arms out to the maximum. Inhale: Bring the arms down releasing from the pose.",
         "pose_links":"https://www.yogajournal.com/videos/chair-pose"
      },
      {
         "id":"82",
         "pose_name":"Supta Baddha Konasana",
         "other_names":"Reclined Bound Angle Pose",
         "pose_description":"Also known as Reclined Cobbler's Pose, is a deeply relaxing yoga position that is recommended for students of all levels. Its Sanskrit name — “Supta Baddha Konasana” (SOOP-tah BAH-duh cone-AHS-uh-nuh) — comes from four words: “Supta” — meaning “reclining”",
         "pose_steps":"\n1) Begin seated in Staff Pose (Dandasana), with your legs extended in front of you on the mat. \n2) Bend your knees and draw your heels in toward your pelvis. \n3)Press the soles of your feet together and let your knees drop open to both sides. \n4) This is Bound Angle (or Cobbler's) Pose (Baddha Konasana).",
         "pose_release":"\n1) To come out of the pose, take the palms of the hands on the outer thighs to gently fold the legs together, and bring the soles of the feet flat down on the mat. \n2) Then, hug your knees into your chest and gently rock from side to side to release the low back.",
         "pose_benefits":"\n1) Stimulates abdominal organs like the ovaries and prostate gland, bladder, and kidneys. \n2) Stimulates the heart and improves general circulation. \n3) Stretches the inner thighs, groins, and knees. \n4) Helps relieve the symptoms of stress, mild depression, menstruation and menopause.",
         "pose_precautions":"\n1) Avoid practicing SuptaBaddhaKonasana if you're suffering from following problems: Shoulder injury, groin injury, knee injury, hip injury. \n2) If you suffer from lower back pain then do not practice it.",
         "pose_links":"https://www.youtube.com/watch?v=vksA9pqOpVI"
      },
      {
         "id":"83",
         "pose_name":"Utkata Konasana",
         "other_names":"Goddess Pose",
         "pose_description":"It is a static plié squat, and is a major external hip opener that fires everything below your waist! Goddess Pose lengthens the adductors of your inner thighs and strengthens your calves, quadriceps, glutes, and core — and it doesn't ignore your upper body.",
         "pose_steps":"\n1) Begin standing in Mountain Pose (Tadasana) at the top of your mat with your arms at your sides. \n2) Turn to the right and step your feet wide apart, about four feet. \n3) On an exhalation, bend your knees directly over your toes and lower your hips into a squat.",
         "pose_release":[],
         "pose_benefits":"\n1) Opens the hips, legs, and chest. \n2) Strengthens the legs, calves, abs, and knees. \n3) Stimulates the uro-genital system and pelvic floor. \n4) Strengthens and stretches the shoulder joint.",
         "pose_precautions":"\n1) Students recovering from shoulders, rib cage, hips, pelvis, knees, ankles and toes injuries should avoid the practice of Goddess Pose. ",
         "pose_links":"https://www.youtube.com/watch?v=TwmHvDwSofI"
      },
      {
         "id":"84",
         "pose_name":"Vakrasana",
         "other_names":"Simple Spinal Twist Pose",
         "pose_description":"The twist also helps reduce belly fat. It increases the elasticity of the spine and relieves vertebrae stiffness.",
         "pose_steps":"\n1) Bring your left hand to the outside of your right knee, exhaling as you gently twist to the right. \n2) Inhale again as you lengthen your spine, and exhale as you twist deeper. \n3) Gaze over your right shoulder. \n4) Do not push hard against your knee to force a deeper twist.",
         "pose_release":[],
         "pose_benefits":"\n1) It stretches the back muscles and glutes. \n2)  It massages the back and hips. \n3) It helps to hydrate the spinal disks. \n4) It lengthens, relaxes, and realigns the spine. \n5) It massages the abdominal organs and strengthens the abdominal muscles. ",
         "pose_precautions":"\n1) Avoid this asana if you have ulcers, slipped disc, or severe spine, shoulder, or hip injury. \n2) Also, as a closed twist, women who are pregnant should avoid this pose.",
         "pose_links":"https://www.siddhiyoga.com/vakrasana-simple-spinal-twist"
      },
      {
         "id":"85",
         "pose_name":"Viparita Karani",
         "other_names":"Legs-Up-the-Wall Pose",
         "pose_description":"Viparita Karani or legs up the wall pose is both an asana and a mudra in hatha yoga. In modern yoga as exercise, it is commonly a fully supported pose using a wall and sometimes a pile of blankets.",
         "pose_steps":"\n1) If you are practicing the supported version, set a bolster or firm, long pillow on the floor against the wall. \n2) Begin the pose by sitting with your left side against the wall. \n3) Gently turn your body to the left and bring your legs up onto the wall. \n4) Lower your back to the floor and lie down. \n5) Shift your weight from side-to-side and scoot your buttocks close to the wall. \n6) Let your arms rest open at your sides, palms facing up. \n7) If you’re using a bolster, your lower back should now be fully supported by it. \n8) Let the heads of your thigh bones (the part of the bone that connects in the hip socket) release and relax, dropping toward the back of your pelvis. \n9) Close your eyes. Hold for 5-10 minutes, breathing with awareness. ",
         "pose_release":"\n1) To release, slowly push yourself away from the wall and slide your legs down to the right side. \n2) Use your hands to help press yourself back up into a seated position.",
         "pose_benefits":"\n1)Strengthened immune system. \n2) Balanced hormonal system. \n3) Calmed nervous system. \n4) Stabilized digestive and elimination systems. \n5) Regulated respiratory system.",
         "pose_precautions":"\n1) Check with your teacher before performing this pose during menstruation. \n2) As with any inversion Viparita Karani should be avoided if you have serious eye problems, such as glaucoma. \n3) With serious neck or back problems only perform this pose with the supervision of an experienced teacher.",
         "pose_links":"https://www.youtube.com/watch?v=_OQEIiZLY-0"
      },
      {
         "id":"86",
         "pose_name":"Garudasana",
         "other_names":"Eagle Pose",
         "pose_description":"Garudasana or Eagle Pose is a standing balancing asana in modern yoga as exercise. The name was used in medieval hatha yoga for a different pose.",
         "pose_steps":"\n1) Bend your knees slightly, lift your left foot up and, balancing on your right foot, cross your left thigh over the right. \n2) Point your left toes toward the floor, press the foot back, and then hook the top of the foot behind the lower right calf. \n3) Balance on the right foot.",
         "pose_release":"\n1) To release, inhale and uncross your arms and legs. \n2) Left both arms up toward the ceiling and place both feet back on the floor.",
         "pose_benefits":"\n1) Stronger arms, legs, knees and ankles. \n2) Open shoulder joints, creating space between the shoulder blades. \n3) Open hips and IT band. \n4) Increased circulation to all joints. \n5) Improved digestion and elimination. \n6) Improved balance. \n7) Improved focus.",
         "pose_precautions":"\n1) Avoid practicing Garudasana in case you have had a recent knee, ankle or shoulder injury. \n2) Eagle pose should not be attempted if you suffer from any of these conditions: Obesity, frequent headaches, high or low blood pressure or asthma.",
         "pose_links":"https://www.youtube.com/watch?v=fC9XQWc6ukk"
      },
      {
         "id":"87",
         "pose_name":"Natarajasana",
         "other_names":"Dancer's Pose",
         "pose_description":" It's a beautiful marriage of strength, flexibility, balance, and meditation. Kinda like the asana jackpot in my mind. It tones and strengthens the leg muscles, stretches and opens the shoulders and chest, improves balance, and focuses the mind.",
         "pose_steps":"\n1) Begin by standing tall in Mountain Pose (Tadasana) with your weight equally distributed in both feet. \n2) Shift your weight onto the right foot. \n3) Bend your left knee to lift your left foot off the floor. \n4) Keep your left knee hugging toward your midline throughout this pose.",
         "pose_release":"\n1) Stay for 5-10 breaths. \n2) To come out of the pose, release the leg as you exhale.",
         "pose_benefits":"\n1) Natarajasana requires and builds full-body strength, flexibility, and coordination. \n2) It opens the shoulders, chest, and hips, as it stretches and strengthens the thighs, ankles, and abdomen. \n3)This pose develops greater flexibility in your spine, shoulders, and hamstrings.",
         "pose_precautions":"\n1) Low blood pressure: Don't do this yoga if you are having low blood pressure. \n2) Balancing: Performing this yoga, balancing is utmost important. \n3) It is better if one practice it before a yoga expert. \n4) Avoid excessive stretching.",
         "pose_links":"https://www.youtube.com/watch?v=3hT2H0mMHNQ"
      },
      {
         "id":"88",
         "pose_name":"Makarasana",
         "other_names":"Crocodile pose",
         "pose_description":"Crocodile Pose (Makarasana) is a beginner yoga pose that relaxes the whole body and helps relieve pain related to other yoga poses or other activities. By lying on your stomach with your chest and shoulders rest, you let go of tension in the lower back and open up your chest and shoulders.",
         "pose_steps":"\n1) Bend your knees so your feet come closer to the center. \n2) Reach your arms back and grasp your ankles. \n3) Slowly lift so your chest and legs are off the yoga mat. \n4) You will feel this pose in your lower back, but it will also open your chest and shoulders like Crocodile Pose.",
         "pose_release":"\n1) Slowly bring the feet together. \n2) Unfold the arms and come to the Prone Position.",
         "pose_benefits":"\n1) It is excellent for people suffering from spondylitis, slipped disc or spinal disorders. \n2) Crocodile pose reduces stress and tension, promotes sleep. \n3) Regulates blood pressure and reduces anxiety. \n4) It gives deep relaxation to the shoulders and the spine.",
         "pose_precautions":"\n1) Avoid moving the body in this asana as it may disturb the practice. \n2) Don't put stress on the body during this asana as it is all about peacefully relaxing the body. \n3) Avoid practicing this asana in the disturbing atmosphere as it may disturb the peace of mind.",
         "pose_links":"https://www.youtube.com/watch?v=tFReLsh9Z7Y"
      },
      {
         "id":"89",
         "pose_name":"Ananda Balasana",
         "other_names":"Happy Baby",
         "pose_description":"It is an easy exercise often done in Pilates and yoga classes. It is a gentle stretch for the hamstrings, inner thigh, and inner groin, a relaxation exercise for the back, and it also opens up the hips, shoulders, and chest. Happy Baby is a nice treat to give yourself any time.",
         "pose_steps":"\n1) Open your knees slightly wider than your torso, then bring them up toward your armpits. \n2) Position each ankle directly over the knee, so your shins are perpendicular to the floor. \n3) Flex through the heels. \n4) Gently push your feet up into your hands (or the belts) as you pull your hands down to create a resistance.",
         "pose_release":"\n1) Exhale and release the feet back to the floor.",
         "pose_benefits":"\n1) Releases lower back and sacrum. \n2) Opens hips, inner thighs, and groin. \n3) Stretches the hamstrings. \n4) Relieves lower back pain. \n5) Stretches and soothes the spine. \n6) Calms the brain. \n7) Helps relieve stress and fatigue.",
         "pose_precautions":"\n1) When doing Happy Baby or Dead Bug, especially if you suffer from a prior knee or neck injury. \n2) A prop, such as a folded blanket, may be used to support the neck while in this pose.",
         "pose_links":"https://www.youtube.com/watch?v=Ppku7i3ypGM"
      },
      {
         "id":"90",
         "pose_name":" Catur Svanasana",
         "other_names":"Forearm Plank",
         "pose_description":"The forearm plank is a static core exercise similar to holding the top of a push-up, with both the elbows and hands making contact with the floor. The pose engages multiple muscle groups at once, simultaneously building core, back, leg and arm strength.",
         "pose_steps":"\n1) Assume a push-up position but bend your arms at your elbows so your weight rests on your forearms. \n2) Tighten your abs, clench your glutes and keep your body straight from head to heels. \n3) Hold as long as you can.",
         "pose_release":"\n1) Release from Catur Svanasana, and as you exhale go lower with the body closer to the floor while supporting the body on the elbows.",
         "pose_benefits":"\n1) Although it's tough, when done correctly, the Forearm Plank strengthens the abs, legs and core. \n2) It is also good for stretching the arches of your feet as well as your calves, shoulders and hamstrings.",
         "pose_precautions":"\n1) The body should not arch or sag. \n2) Mostly the Plank targets the abdominals (muscles responsible for holding in the stomach and giving the appearance of a flat stomach), but it can be an excellent way to get a full body challenge.",
         "pose_links":"https://www.youtube.com/watch?v=qzQ0AaXV0zA"
      },
      {
         "id":"91",
         "pose_name":"Eka Pada Rajakapotasana",
         "other_names":"Pigeon pose",
         "pose_description":"Kapotasana or Pigeon Pose is a kneeling back-bending asana in modern yoga as exercise.",
         "pose_steps":"\n1) Sit with your knees bent, feet flat on the floor, arms behind you for support. \n2) Bring your right ankle over your left knee, keeping the foot flex. \n3) Walk your left foot closer to your hip to increase the stretch. \n4) You can also do Figure four lying on your back.",
         "pose_release":[],
         "pose_benefits":"\n1) Stimulate the internal organs. \n2) Stretch deep glutes. \n3) Stretch groins and psoas (a long muscle on the side of your vertebral column and pelvis). \n4) Relieve impinged piriformis and alleviate sciatic pain. \n5) Help with urinary disorders. ",
         "pose_precautions":"\n1) In case of sacroiliac injury do not practice this posture. \n2) If you have ankle or knee injury, avoid this posture. \n3) Recent or chronic back injury is contraindication for that posture.",
         "pose_links":"https://www.youtube.com/watch?v=xsnR0YpTSL8"
      },
      {
         "id":"93",
         "other_names":"Dand",
         "pose_description":"Dands are jackknifing push-ups and bethaks are comparable to Western-style deep knee bends. Although dands and bethaks are done separately, they are usually referred to as a pair. As a set they provide a complete body workout. ... They should sway with the movement of the body in order to maintain balance.",
         "pose_steps":"\n1) One starts a dand from a face-down, prone position with feet placed close together and palms flat on the ground directly below the shoulders about half a meter apart. \n2) To begin, one cocks the body back by lifting one's buttocks into the air while straightening both arms and legs",
         "pose_release":[],
         "pose_benefits":"\n1) Gaining weight. \n2) Making the body stronger and build muscles. \n3) It also increases stamina.",
         "pose_links":"https://www.youtube.com/watch?v=SITGTRvG7d0"
      }
   ]

